Repository: eakkew/pickul-i18n
Catalog: reddit_i18n/*/LC_MESSAGES/r2.po
Languages: th

source: thanks for your message! you should hear back from us shortly.
th: ขอบคุณค่ะ ทางทีมงานพิกุลได้รับข้อความของคุณ เรียบร้อยแล้วค่ะ ทางเจ้าหน้าที่จะรีบติดต่อกลับไปค่ะ

source: your message has been delivered
th: ข้อความของคุณได้ถูกส่งแล้ว

source: no title found
th: ไม่พบชื่อเรื่องที่ค้นหา

source: saved
th: บันทึกเรียบร้อย

source: you should be getting a verification email shortly.
th: ระบบจะทำการส่งอีเมลยืนยันให้คุณ กรุณาเช็คอีเมลเพื่อยืนยันการสมัครสมาชิก

source: your email has been updated
th: อีเมลใหม่ได้ทำการบันทึกแล้ว

source: your email and password have been updated
th: อีเมลและรหัสผ่านใหม่ได้ทำการบันทึกแล้ว

source: your password has been updated
th: รหัสผ่านใหม่ได้ทำการบันทึกแล้ว

source: replied
th: ตอบกลับเรียบร้อย

source: shared
th: แบ่งปันเรียบร้อย

source: your link has been shared.
th: ลิงค์ของคุณได้รับการเผยแพร่แล้ว

source: validation errors
th: เกิดความผิดพลาด กรุณาตรวจสอบ (validation errors)

source: conflict error
th: เกิดความผิดพลาด กรุณาตรวจสอบ (conflict error)

source: There was a conflict while editing the stylesheet
th: มีความขัดแย้งเกิดขึ้นระหว่างการแก้ไข stylesheet

source: deleted
th: ลบแล้ว

source: bad image name
th: ชื่อรูปภาพไม่เหมาะสม

source: too many images (you only get %d)
th: มีรูปภาพมากเกินไป (คุณจะได้รับแค่ %d)

source: Invalid image or general image error
th: ไฟล์รูปภาพไม่ถูกต้อง หรือ ไฟล์รูปภาพไม่สมบูรณ์

source: Sidebar was not saved
th: แถบด้านข้างยังไม่ได้ทำการบันทึก

source: Description was not saved
th: คำอธิบายยังไม่ได้ทำการบันทึก

source: an email will be sent to that account's address shortly
th: ระบบจะทำการส่งอีเมลไปที่ที่อยู่อีเมลที่ระบุไว้ในบัญชีผู้รับนั้นในไม่ช้า

source: try again tomorrow
th: กรุณาลองใหม่อีกครั้งในวันพรุ่งนี้ค่ะ

source: invalid client id
th: ชื่อ Client ID ไม่ถูกต้อง

source: cannot update deleted app
th: ไม่สามารถทำการ update App ที่ลบแล้วได้

source: app does not belong to you
th: คุณไม่ได้เป็นเจ้า App นี้

source: account
th: บัญชีผู้ใช้

source: flair
th: ตราประจำตัว

source: links & comments
th: ลิงค์ และ ความคิดเห็น

source: private messages
th: ข้อความส่วนตัว

source: misc
th: อื่นๆ

source: listings
th: รายการ

source: search
th: ค้นหา

source: subreddits
th: กลีบพิกุล

source: users
th: ผู้ใช้

source: wiki
th: วิกิ

source: reddit buttons
th: Pickul Buttons

source: reddit widget
th: Pickul Widget

source: help
th: ช่วยเหลือ

source: you are not allowed to do that
th: คุณไม่ได้รับอนุญาตให้กระทำการดังกล่าว

source: page not found
th: ไม่พบหน้าที่ต้องการ

source: the page you requested does not exist
th: ไม่พบหน้าที่คุณต้องการ หรือหน้านี้ไม่ได้อยู่ในระบบแล้ว

source: self service help
th: บริการตัวเอง

source: no comments (yet)
th: ยังไม่มีความคิดเห็น

source: all %d comments
th: %d ความคิดเห็น

source: top %d comments
th: %d ความคิดเห็นยอดนิยม

source: show all %d
th: แสดงทั้งหมด %d

source: show %d
th: แสดง %d

source: create a subreddit
th: สร้างกลีบพิกุลใหม่

source: all
th: ทั้งหมด

source: filter by action
th: แสดงเฉพาะ Action

source: filter by moderator
th: แสดงเฉพาะผู้ดูแล

source: awards
th: รางวัล

source: related
th: ที่เกี่ยวข้อง

source: other discussions
th: หัวข้อสนทนาอื่นๆ

source: search results
th: ผลการค้นหา

source: seen it
th: อ่านแล้ว

source: submit
th: ส่งข้อความ

source: rules of reddit
th: กฎของพิกุล

source: thanks for buying reddit gold! your transaction has been completed and emailed to you. you can check the details by logging into your account at:
th: ขอบคุณที่ซื้อ สถานะพิกุลทอง! การชำระเงินสำเร็จสมบูรณ์และ ระบบได้อีเมลให้คุณแล้วค่ะ คุณสามารถตรวจสอบรายละเอียดได้โดยการล็อคอินเข้าสู่บัญชีของคุณที่ :

source: claimed! enjoy your reddit gold membership.
th: จงเบิกบาน! คุณได้เลื่อนบรรดาศักดิ์ของสมาชิกเป็นระดับ พิกุลทอง

source: your gold creddits have been claimed!
th: เหรียญทองพิกุลของคุณได้ถูกใช้แล้วค่ะ

source: now go to someone's userpage and give them a present!
th: ทีนี้คุณลองไปเยี่ยมหน้าโปรไฟล์สมาชิกชาวพิกุลท่านอื่นและให้ของขวัญเขาสิ!

source: thanks for buying reddit gold! your transaction is being processed. if you have any questions please email us at %(gold_email)s
th: ขอบคุณสำหรับการซื้อสถานะพิกุลทอง! การชำระเงินของท่านอยู่ในระหว่างดำเนินการค่ะ ถ้าคุณมีคำถามหรือข้อสงสัย สามารถอีเมลหาทีมงานพิกุลได้ที่ %(gold_email)s

source: thanks
th: ขอบคุณ

source: claim this award?
th: ใช้รางวัลนี้หรือไม่?

source: award claim
th: รางวัลนี้ได้ถูกใช้แล้ว

source: gold
th: สถานะพิกุลทอง

source: password
th: รหัสผ่าน

source: verify email
th: ยืนยันอีเมล

source: reset password
th: ตั้งรหัสผ่านใหม่

source: opt out
th: เลือกออก

source: welcome back
th: ยินดีต้อนรับกลับ

source: reddit gold
th: สถานะพิกุลทอง

source: nice try.
th: พยายามได้ดีค่ะ

source: that user has deleted their account
th: ชาวพิกุลท่านนั้นได้ลบบัญชีออกจากระบบไปแล้ว

source: the gold has been delivered!
th: สถานะพิกุลทองได้ส่งมอบเรียบร้อยแล้ว

source: gold order
th: สั่งซื้อสถานะพิกุลทอง

source: your order has been received and gold will be delivered shortly. please bear with us as google wallet payments can take up to an hour to complete
th: ระบบได้รับคำสั่งซื้อของคุณแล้วและสถานะพิกุลทองจะถูกส่งให้ในไม่ช้า กรุณารอสักครู่ค่ะ google wallet payments อาจจะใช้เวลาถึง 1 ชั่วโมงในการดำเนินการชำระเงินให้เรียบร้อยค่ะ

source: thanks for buying reddit gold!
th: ขอบคุณค่ะสำหรับการสั่งซื้อสถานะพิกุลทอง!

source: thanks for buying creddits!
th: ขอบคุณค่ะสำหรับการสั่งซื้อเหรียญทองพิกุล!

source: To spend them, visit [/gold](/gold) or your favorite person's userpage.
th: การใช้จ่ายเหรียญทอง, ไปที่หน้า [/gold](/gold) หรือหน้าโปรไฟล์ของชาวพิกุลที่ท่านชื่นชอบ

source: thanks for giving reddit gold!
th: ขอบคุณสำหรับการให้สถานะพิกุลทอง!

source: Your gift to %s has been delivered.
th: ของขวัญสำหรับ %s ได้ถูกส่งให้เรียบร้อยแล้วค่ะ

source: something bad happened, try again later
th: มีบางอย่างผิดปกติเกิดขึ้น กรุณาลองใหม่อีกครั้ง

source: stop trying to trick the form
th: ได้โปรดอย่าล่อลวงแบบฟอร์ม!

source: error: address verification failed
th: error: ที่อยู่ไม่ถูกต้อง

source: error: cvc check failed
th: error: รหัส cvc ตรวจสอบไม่ผ่าน

source: payment submitted
th: การชำระเงินเสร็จสมบูรณ์

source: gold payment
th: ชำระด้วยเหรียญทองพิกุล

source: your payment is being processed and gold will be delivered shortly
th: การชำระเงินของคุณกำลังดำเนินการและเหรียญทองพิกุลจะถูกส่งมอบในไม่ช้า

source: newest submissions
th: กระทู้ล่าสุด

source: rising submissions
th: กระทู้มาแรง

source: top scoring links
th: ลิงค์ที่มีคะแนนสูงสุด

source: most controversial links
th: ลิงค์ดราม่า

source: you're really bored now, eh?
th: เบื่อแล้วล่ะสิ ใช่ป่าว?

source: filter by subreddit
th: แสดงเฉพาะกลีบพิกุล

source: overview for %(user)s
th: ภาพรวมสำหรับ %(user)s

source: comments by %(user)s
th: ความคิดเห็นโดย %(user)s

source: submitted by %(user)s
th: กระทู้โดย %(user)s

source: liked by %(user)s
th: ลิงค์โดย %(user)s

source: disliked by %(user)s
th: ไม่โปรดปรานโดย %(user)s

source: saved by %(user)s
th: เก็บบันทึกโดย %(user)s

source: hidden by %(user)s
th: ถูกซ่อนโดย %(user)s

source: promoted by %(user)s
th: สนับสนุนโดย %(user)s

source: profile for %(user)s
th: ข้อมูลส่วนตัวของ %(user)s

source: unread
th: ที่ยังไม่ได้อ่าน

source: comment replies
th: ข้อความตอบกลับความคิดเห็น

source: post replies
th: ข้อความตอบกลับกระทู้

source: messages
th: ข้อความ

source: subreddits:
th: กลีบพิกุล:

source: comments
th: ความคิดเห็น

source: gilded comments
th: ความคิดเห็นที่ประทับใจ

source: over 18?
th: อายุมากกว่า 18 ปี?

source: promoted by you
th: สนับสนุนโดยคุณ

source: added
th: เพิ่มแล้ว

source: failed to authenticate card. sorry.
th: ขออภัย ล้มเหลวในการยืนยันบัคร

source: bad image
th: รูปภาพไม่เหมาะสม

source: search failed
th: การค้นหาล้มเหลว

source: This page is the subreddit stylesheet, changes here apply to the subreddit css
th: หน้านี้คือ stylesheet ของกลีบพิกุล, การแก้ไขมีผลกับกลีบพิกุล css

source: The contents of this page appear on the subreddit sidebar
th: เนื้อหาของหน้านี้จะปรากฎอยู่ที่แถบด้านข้างของกลีบพิกุล

source: The contents of this page appear in the public subreddit description
th: เนื้อหาของหน้านี้จะปรากฎในส่วนคำอธิบายของกลีบพิกุล

source: viewing revision from %s
th: กำลังดูประวัติการแก้ไขจาก %s

source: %s ago
th: %s ที่แล้ว

source: comparing revisions from %(date_1)s and %(date_2)s
th: เปรียบเทียบประวัติการแก้ไขในช่วง %(date_1)s และ %(date_2)s

source: viewing revision from %s ago
th: กำลังดูประวัติการแก้ไขเมื่อ %s ที่แล้ว

source: this wiki cannot handle page names of that magnitude! please select a page name shorter than %d characters
th: ระบบวิกิไม่สามารถรองรับชื่อหน้าที่มีความยาวขนาดนั้นได้! กรุณาเลือกชื่อ หน้าที่สั้นกว่า %d ตัวอักษร

source: this page is a special page, please go into the subreddit settings and save the field once to create this special page
th: หน้านี้เป็นหน้าพิเศษ, กรุณาไปที่หน้าตั้งค่าของกลีบพิกุลและกดบันทึกฟิลล์เพื่อสร้างหน้าพิเศษ

source: a max of %d separators "/" are allowed in a wiki page name.
th: %d เป็นจำนวนสูงสุดของสัญลักษณ์ "/" ที่อนุญาตให้นำมาตั้งชื่อเป็นหน้าวิกิ

source: Wiki error
th: เกิดข้อผิดพลาดขึ้นในวิกิ

source: You are doing that too much, please try again later.
th: คุณได้ทำการกระทำซ้ำมากเกินไป กรุณาลองใหม่อีกครั้ง

source: if you need backslashes, you're doing it wrong
th: ถ้าคุณต้องการใช้ backslashes คุณกำลังทำผิดอยู่

source: please login to do that
th: กรุณาเข้าสู่ระบบก่อนดำเนินการต่อไป

source: this page must be accessed using https
th: หน้านี้ต้องการการเข้าถึงด้วย https

source: you need to set a valid email address to do that.
th: คุณต้องใช้อีเมลที่ถูกต้องในการดำเนินการ

source: a url is required
th: ต้องการ URL

source: you should check that url
th: คุณควรตรวจสอบความถูกต้องของ URL

source: care to try these again?
th: ลองใหม่อีกครั้งไหม?

source: invalid user name
th: ชื่อผู้ใช้ไม่ถูกต้อง

source: that username is already taken
th: ชื่อผู้ใช้งานได้ถูกใช้ไปแล้ว

source: that username is taken by a deleted account
th: ชื่อผู้ใช้งานได้ถูกบัญชีที่ลบไปแล้วใช้งานไปก่อนหน้านี้

source: you can't send to a user that you have blocked
th: คุณไม่สามารถส่งให้ชาวพิกุลที่คุณทำการตัดขาดได้

source: id not specified
th: ID ไม่เจาะจง

source: you provided too many ids
th: คุณใส่ ID มากเกินไป

source: you can't do that
th: ทำอย่างนั้นไม่ได้นะคะ

source: you are not logged in as that user
th: คุณไม่ได้เข้าสู่ระบบด้วยชื่อชาวพิกุลนั้น

source: you are already logged in
th: คุณอยู่ในระบบอยู่แล้ว

source: the link you are commenting on has been deleted
th: ลิงค์ที่คุณกำลังแสดงความคิดเห็นได้ถูกลบไปแล้ว

source: that comment has been deleted
th: ความคิดเห็นนั้นได้ถูกลบไปแล้ว

source: that element has been deleted
th: ส่วนประกอบนั้นได้ถูกลบไปแล้ว

source: that password is unacceptable
th: รหัสผ่านไม่ได้มาตรฐาน

source: invalid password
th: รหัสผ่านไม่ถูกต้อง

source: passwords do not match
th: รหัสผ่านไม่ตรงกัน

source: please enter a name
th: กรุณาใส่ชื่อ

source: please enter an email address
th: กรุณาใส่ที่อยู่อีเมล

source: no email address for that user
th: ไม่มีอีเมลของชาวพิกุลคนนั้น

source: send it to whom?
th: ส่งให้ใครคะ?

source: please enter a subject
th: กรุณาใส่หัวข้อ

source: that user doesn't exist
th: ชาวพิกุลคนนั้นไม่มีตัวตน

source: please enter a username
th: กรุณาใส่ชื่อชาวพิกุล(username)

source: that number isn't in the right range (%(range)s)
th: ตัวเลขไม่ได้อยู่ในขอบเขต (%(range)s)

source: you used a character here that we can't handle
th: คุณใช้อักขระที่ระบบไม่รองรับ

source: your bid must be at least $%(min)d per day and no more than to $%(max)d in total.
th: การประมูลของคุณต้องกระทำอย่างน้อย $%(min)d ต่อวัน และไม่เกิน $%(max)d โดย รวม

source: that link has already been submitted
th: ลิงค์ดังกล่าวได้ถูกเผยแพร่แล้ว

source: that subreddit already exists
th: ชื่อกลีบพิกุลนี้มีอยู่แล้ว

source: that subreddit doesn't exist
th: กลีบพิกุลนี้ยังไม่มี

source: you aren't allowed to post there.
th: คุณไม่ได้รับอนุญาตให้สร้างกระทู้ที่นั่น

source: you must specify a subreddit
th: คุณต้องระบุชื่อกลีบพิกุล

source: that name isn't going to work
th: ชื่อนั้นใช้ไม่ได้ค่ะ

source: you are doing that too much. try again in %(time)s.
th: คุณได้กระทำสิ่งนั้นมากเกินไป กรุณาลองใหม่อีกครั้งใน %(time)s

source: You've submitted too many links recently. Please try again in an hour.
th: คุณได้เผยแพร่ลิงค์มากเกินไปในเวลาอันสั้น กรุณาลองใหม่อีกครั้งใน 1 ชั่งโมง

source: you are doing that too much. try again later.
th: คุณได้กระทำสิ่งนั้นมากเกินไป กรุณาลองใหม่อีกครั้ง

source: your session has expired
th: Session ของคุณหมดเวลาแล้ว

source: you must accept the terms first
th: คุณต้องยอมรับในข้อตกลงของพิกุลก่อน

source: that option is not valid
th: ตัวเลือกนั้นไม่ถูกต้อง

source: the following emails are invalid: %(emails)s
th: อีเมล %(emails)s ไม่ถูกต้อง

source: please enter at least one email address
th: กรุณาระบุอย่างน้อย 1 อีเมล

source: please only share to %(num)s emails at a time.
th: กรุณาแบ่งปันไม่เกิน %(num)s อีเมลต่อครั้ง

source: that subreddit has already been oversold on %(start)s to %(end)s. Please pick another subreddit or date.
th: กลีบพิกุลนั้นได้ถูก oversold ตั้งแต่ %(start)s ถึง %(end)s กรุณาเลือกกลีบพิกุลใหม่หรือเลือกวันที่อื่นๆ

source: please provide a date of the form mm/dd/yyyy
th: กรุณาใส่วันที่ในรูปแบบ mm/dd/yyyy

source: the dates need to be in order and not identical
th: วันที่ต้องเรียงตามลำดับและไม่ซ้ำกัน

source: you must choose a date range of less than %(days)s days
th: คุณต้องเลือกช่วงวันที่ไม่น้อยกว่า %(days)s วัน

source: please enter a date at least %(day)s days in the future
th: กรุณาระบุวันที่อย่างน้อย %(day)s วัน ในอนาคต

source: please enter a date at least %(day)s days in the past
th: กรุณาระบุวันที่อย่างน้อย %(day)s วัน ในอดีต

source: this is too long (max: %(max_length)s)
th: ข้อความยาวเกินไป (max: %(max_length)s)

source: we need something here
th: กรุณาระบุ

source: we've never seen that code before
th: ไม่เคยเห็น Code นั้นมาก่อน

source: that code has already been claimed -- perhaps by you?
th: Code นั้นได้ถูกใช้ไปแล้ว -- บางทีอาจจะเป็นคุณ?

source: that subreddit doesn't allow text posts
th: กลีบพิกุลนี้ไม่อนุญาตให้สร้างกระทู้ที่เป็นแบบข้อความ

source: that subreddit only allows text posts
th: กลีบพิกุลนี้อนุญาตแต่กระทู้แบบข้อความเท่านั้น

source: that's a piece of history now; it's too late to reply to it
th: มันกลายเป็นประวัติศาสตร์ไปแล้ว มันสายไปแล้วที่จะทำการ ตอบกลับ

source: access denied by the user
th: ปฏิเสธการเข้าถึงโดยผู้ใช้

source: please confirm the form
th: กรุณายืนยันแบบฟอร์ม

source: conflict error while saving
th: มีการขัดแย้งเกิดขึ้นระหว่างทำการบันทึก

source: cannot perform this action via the API
th: ไม่สามารถทำ action นี้ได้ผ่าน API

source: %(domain)s is not allowed on reddit: %(reason)s
th: %(domain)s ไม่ถูกอนุญาตในระบบพิกุล: %(reason)s

source: you must enable two-factor authentication
th: คุณต้องเปิดใช้งาน Two-factor Authentication

source: this feature is not supported
th: Feature นี้ไม่ถูกสนับสนุนโดยระบบพิกุล

source: image problem
th: ปัญหาเกี่ยวกับรูปภาพ

source: already added
th: เพิ่มเข้าไปแล้ว

source: too many developers
th: มีนักพัฒนามากเกินไป

source: i don't believe you.
th: ฉันไม่เชื่อคุณ

source: that user is already a moderator
th: ชาวพิกุลท่านนี้เป็นผู้ดูแลอยู่แล้ว

source: there is no pending invite for that subreddit
th: ไม่มี คำเชิญที่รอการตอบรับ สำหรับกลีบพิกุลนั้น

source: you cannot edit the bid of a live ad
th: คุณไม่สามารถแก้ไขค่าประมูลของ Ad ที่แสดงอยู่ได้

source: you have too many campaigns for that promotion
th: คุณมี campaigns มากเกินไปสำหรับ promotion นั้น

source: permissions don't apply to that type of user
th: สิทธิดังกล่าวไม่ได้นำไปใช้กับประเภทของผู้ใช้งานนั้น

source: Funny 500 page message 1
th: ระบบพิกุลกำลังจะระเบิด มีชาวพิกุลมารวมกันมากเกินไป

source: Funny 500 page message 2
th: การเลื่อนบรรดาศักดิ์เป็นพิกุลทอง ช่วยทำให้ระบบพิกุลแข็งแรงขึ้น

source: Funny 500 page message 3
th: ระบบรับไม่ไหวแล้วววว!!

source: Funny 500 page message 4
th: อย่าบอกใครนะว่ามาเจอหน้านี้เข้า อายอ่ะ

source: Reason to create a reddit 1
th: ...เพื่อการรณรงค์การรักษาสิ่งแวดล้อม

source: Reason to create a reddit 2
th: ...เพื่อความฟินของชนชั้นกลาง

source: Reason to create a reddit 3
th: ...เพื่อเอาไว้รวมรุ่นมัธยม

source: Reason to create a reddit 4
th: ...เพื่อกิลragnarokของคุณ

source: Reason to create a reddit 5
th: ...เพื่อหาเพื่อนที่ชอบเหมือนๆกัน

source: Reason to create a reddit 6
th: ...สำหรับเกมส์ที่คุณชอบ

source: Reason to create a reddit 7
th: ...สำหรับดาราสุดหล่อของคุณ

source: Reason to create a reddit 8
th: ...เพื่อพัฒนาชุมชนของคุณ

source: Reason to create a reddit 9
th: ...สำหรับอาหารจานโปรด

source: Reason to create a reddit 10
th: ...เพื่ออนาคตทางการเงิน

source: Reason to create a reddit 11
th: ...สำหรับบริษัทของคุณ

source: Reason to create a reddit 12
th: ...เพื่อความเป็นธรรมในหมู่มวลชน

source: Reason to create a reddit 13
th: ...เพื่อให้เมืองไทยน่าอยู่ขึ้น

source: Reason to create a reddit 14
th: ...เพื่อสิ่งที่คุณรัก

source: Reason to create a reddit 15
th: ...สำหรับสิ่งที่กำลังสูญพันธ์

source: Reason to create a reddit 16
th: ...เพื่อความสะดวกสบายในการใช้ชีวิต

source: Reason to create a reddit 17
th: ...เพื่อพรรคการเมืองที่คุณชื่นชอบ

source: Reason to create a reddit 18
th: ...เพื่อผีแดง

source: Reason to create a reddit 19
th: ...เพื่อสถานที่ท่องเที่ยวสุดสัปดาห์

source: Reason to create a reddit 20
th: ...เพื่อลูกหลานของคุณ

source: [removed]
th: [ลบแล้ว]

source: hot
th: ที่นิยม

source: new
th: ล่าสุด

source: old
th: เก่าสุด

source: ups
th: โหวตขึ้น

source: downs
th: โหวตลง

source: top
th: ติดอันดับ

source: more
th: ดูเพิ่ม

source: relevance
th: ความเกี่ยวข้อง

source: controversial
th: ที่ดราม่า

source: best
th: ติดอันดับยอดนิยม

source: random
th: สุ่ม

source: saved {toolbar}
th: คลัง

source: recommended
th: ที่ถูกแนะนำ

source: rising
th: กำลังมาแรง

source: admin
th: ท่านผู้นำ

source: this hour
th: ชั่วโมงนี้

source: today
th: วันนี้

source: this week
th: สัปดาห์นี้

source: this month
th: เดือนนี้

source: this year
th: ปีนี้

source: all time
th: ทั้งพิกุลศก

source: logout
th: ออกจากระบบ

source: contact us
th: ติดต่อเรา

source: buttons
th: ปุ่ม

source: source code
th: รหัสโปรแกรมต้นฉบับ

source: store
th: ร้านค้า

source: team
th: ทีมผู้พัฒนา

source: rules
th: กฎการใช้งาน

source: options
th: ตัวเลือก

source: friends
th: เพื่อน

source: password/email
th: รหัสผ่าน/อีเมล

source: delete
th: ลบ

source: compose
th: เขียนข้อความ

source: inbox
th: ถาดเข้า

source: sent
th: ส่งออก

source: comments {toolbar}
th: ความคิดเห็น

source: details
th: รายละเอียด

source: other discussions (%(num)s)
th: การถกเถียงอื่นๆ (%(num)s)

source: traffic stats
th: สถิติการเข้าชม

source: home
th: หน้าหลัก

source: about
th: เกี่ยวกับเรา

source: edit subscriptions
th: แก้ไขรายการที่ติดตาม

source: subreddit settings
th: ตั้งค่ากลีบพิกุล

source: edit moderators
th: ตั้งค่าผู้ดูแล

source: moderator mail
th: อีเมลของผู้ดูแล

source: edit approved submitters
th: ตั้งค่าผู้ที่สามารถสร้างกระทู้

source: ban users
th: ชาวพิกุลที่ถูกแบน

source: edit flair
th: ตั้งค่าไอคอน

source: moderation log
th: ประวัติการดูแล

source: moderation queue
th: งานที่รอการตรวจสอบ

source: unmoderated links
th: ลิงค์ที่ยังไม่ได้ตรวจสอบ

source: ban wiki contributors
th: วิกิ contributors ที่ถูกแบน

source: add wiki contributors
th: เพิ่ม วิกิ contributors

source: recent wiki revisions
th: ประวัติการแก้ไขเมื่อเร็วๆนี้

source: wiki page list
th: รายชื่อหน้าวิกิ

source: popular
th: ยอดนิยม

source: create
th: สร้าง

source: my subreddits
th: กลีบพิกุลของฉัน

source: reporters
th: ผู้แจ้ง

source: reported links
th: ลิงค์ที่ถูกแจ้ง

source: reported authors
th: ผู้เขียนที่ถูกแจ้ง

source: info
th: ข้อมูล

source: share
th: แบ่งปัน

source: overview
th: ภาพรวม

source: submitted
th: ส่งแล้ว

source: liked
th: ที่ถูกใจ

source: disliked
th: ที่ไม่ถูกใจ

source: hidden {toolbar}
th: ซ่อนไว้

source: reported
th: ถูกแจ้ง

source: self-serve advertising
th: สร้างโฆษณาด้วยตัวเอง

source: create promotion
th: สร้างโปรโมขัน

source: my promoted links
th: ลิงค์ที่ถูกฉันโปรโมต

source: all promoted links
th: ลิงค์ที่ถูกโปรโมตทั้งหมด

source: unseen
th: ยังไม่ได้อ่าน

source: roadblock
th: สิ่งกีดขวาง

source: unpaid
th: ยังไม่ได้ชำระเงิน

source: pending
th: กำลังดำเนินการ

source: rejected
th: ที่ถูกปฏิเสธ

source: sitewide
th: โครงสร้างเว็บไซต์

source: languages
th: ภาษา

source: adverts
th: โฆษณา

source: mod
th: ผู้ดูแล

source: front
th: หน้าแรก

source: myrandom
th: สุ่มกลีบพิกุล

source: sorted by
th: เรียงโดย

source: kind
th: ประเภท

source: links from
th: ลิงค์จาก

source: current edit
th: เวอร์ชั่นปัจจุบัน

source: your edit
th: ที่คุณได้แก้ไข

source: access
th: เข้าสู่

source: manage the lists of contributors and banned users
th: จัดการรายชื่อของผู้เขียนและผู้ใช้ที่ถูกแบน

source: config
th: ตั้งค่า

source: edit settings, sidebar, css, and images
th: แก้ไข การตั้งค่า แถบด้านข้าง css และรูปภาพ

source: manage user flair, link flair, and flair templates
th: จัดการ flair ของผู้ใช้, flair ของลิงค์ และ flair ของแม่แบบ

source: mail
th: อีเมล

source: read and reply to moderator mail
th: อ่านและตอบกลับไปทีอีเมลของผู้ดูแล

source: posts
th: กระทู้

source: use the approve, remove, spam, distinguish, and nsfw buttons
th: ใช้ ปุ่มอนุญาต ปุ่มลบ ปุ่ม spam ปุ่มแยกแยะ และ ปุ่มไม่ปลอดภัยสำหรับที่สาธารณะ

source: manage the wiki and access to the wiki
th: จัดการวิกิและการเข้าถึงวิกิ

source: day
th: วัน

source: submitting...
th: กำลังส่ง...

source: that link has already been submitted, but you can try to [submit it again](%s).
th: ลิงค์นี้ได้ถูกเผยแพร่ไปแล้ว แต่คุณสามารถลอง [ส่งใหม่อีกครั้ง](%s).

source: your account has been deleted, but we won't judge you for it.
th: บัญชีของคุณได้ถูกลบแล้ว คุณคงมีเหตุผลบางอย่าง เราเข้าใจคุณ

source: you'll need to login or register to do that
th: คุณต้องเข้าสู่ระบบหรือสมัครสมาขิกเพื่อดำเนินการต่อ

source: (don't worry, it only takes a few seconds)
th: (อย่าได้กังวลไป มันใช้เวลาแค่ 2-3 วินาทีเท่านั้น)

source: Log in or register to connect your reddit account with %(app)s.
th: เข้าสู่ระบบหรือสมัครสมาชิกเพื่อเชื่อมต่อบัญชีพิกุลกับ %(app)s

source: try using our secure login form.
th: กรุณาใช้แบบฟอร์มเข้าสู่ระบบที่ปลอดภัยของเรา

source: I understand and agree that registration on or use of this site constitutes agreement to its %(user_agreement)s and %(privacy_policy)s.
th: ฉันเข้าใจและยอมรับว่าการเป็นสมาชิกหรือการใช้เว็บไซต์พิกุลเป็นไปตาม ข้อตกลงที่ระบุไว้ใน %(user_agreement)s และ %(privacy_policy)s.

source: to view reddit with only submissions from your friends, use [reddit.com/r/friends](%s)
th: หากต้องการดูพิกุลแค่กระทู้ที่ส่งขึ้นโดยเพื่อนของคุณ ให้ใช้ [pickul.com/r/friends](%s)

source: your subreddit has been created
th: ห้องกลีบพิกุลของคุณได้ถูกสร้างแล้ว

source: visit [%(link)s](%(link)s) for more information
th: เยี่ยมชม [%(link)s](%(link)s) สำหรับรายละเอียดเพิ่มเติม

source: you have not subscribed to any subreddits.
th: คุณไม่ได้ติดตามห้องกลีบพิกุลใดๆ

source: below are the subreddits you have subscribed to
th: ข้างล่างนี้เป็นห้องกลีบพิกุลที่คุณติดตามอยู่

source: below are the subreddits that you are an approved submitter on.
th: ข้างล่างนี้คือห้องกลีบพิกุลที่อนุญาตให้คุณสร้างกระทู้ได้

source: below are the subreddits that you have moderator access to.
th: ข้างล่างนี้คือห้องกลีบพิกุลที่คุณเป็นผู้ดูแล

source: click the `subscribe` or `unsubscribe` buttons to choose which subreddits appear on your front page.
th: คลิกปุ่ม `ติดตาม` หรือ `เลิกติดตาม` เพื่อเลือกกระทู้จากห้องกลีบพิกุลที่จะปรากฎในหน้าแรกของคุณ

source: you're searching within the [%(reddit_name)s](%(reddit_link)s) subreddit. you can also search within [all subreddits](%(all_reddits_link)s)
th: คุณกำลังค้นหาในห้องกลีบพิกุล [%(reddit_name)s](%(reddit_link)s) คุณยังสามารถค้นหาได้จาก [all subreddits](%(all_reddits_link)s)

source: "%(brokenurl)s" is not a valid URL
th: "%(brokenurl)s" ไม่ใช่ URL ที่ถูกต้อง

source: "%(cssprop)s" is not a valid CSS property
th: "%(cssprop)s" ไม่ใช่ CSS property ที่ถูกต้อง

source: "%(cssvalue)s" is not a valid value for CSS property "%(cssprop)s"
th: "%(cssvalue)s" ไม่ใช่ค่าที่ถูกต้องของ CSS property "%(cssprop)s"
