Repository: eakkew/pickul-i18n
Catalog: reddit_i18n/*/LC_MESSAGES/r2.po
Languages: th

source: too big. keep it under %(max_size)dkb
th: ใหญ่เกินไป กรุณาทำให้ต่ำกว่า %(max_size)dkb

source: %(author)s comments on %(title)s
th: %(author)s ให้ความเห็นในกระทู้ %(title)s

source: this subreddit has been banned
th: ห้องกลีบพิกุลนี้ได้ถูกแบน

source: most likely this was done automatically by our spam filtering program. the program is still learning, and may even have some bugs, so if you feel the ban was a mistake, please submit a link to our [request a subreddit listing](%(link)s) and be sure to include the **exact name of the subreddit**.
th: โดยส่วนใหญ่แล้วการโพสข้อมูลต่างๆจะถูกคัดกรองโดยระบป้องกัน spam ของเรา แต่ระบบนี้กำลังเรียนรู้ด้วยตัวมันเองและอาจจะยังมีข้อผิดพลาด ถ้าคุณคิดว่าการถูกแบนเป็นเรื่องเข้าใจผิด กรุณาส่งลิงค์ไปที่ [ยื่นคำร้องขอสร้างห้องกลีบพิกุล](%(link)s) และอย่าลืมแนบชื่อห้องที่ต้องการ

source: this subreddit is private
th: ห้องกลีบพิกุลนี้เป็นแบบปิด

source: the moderators of this subreddit have set it to private. you must be a moderator or approved submitter to view its contents.
th: ผู้ดูแลของห้องกลีบพิกุลนี้ได้ตั้งค่าห้องเป็นแบบปิด ในการเรียกดูข้อมูลคุณต้องมีสถานะเป็นผู้ดูแลหรือเป็นสมาชิกของห้อง

source: The following is a sample of what Reddit users had to say about this page. The full discussion is available [here](%(fd_link)s); you can also get there by clicking the link's title (in the middle of the toolbar, to the right of the comments button).
th: ตัวอย่างต่อไปนี้เป็นข้อความที่ขาวพิกุลได้พูดถึงห้องกลีบพิกุลนี้การอภิปรายแบบเต็มสามารถเข้าถึงได้ [ที่นี่](%(fd_link)s); นอกจากนั้นแล้วคุณยังสามารถไปที่หน้านั้นได้โดยการคลิกที่ลิงค์ของหัวข้อ (อยู่กลาง toolbar, ด้านขวาของ ปุ่มแสดงความคิดเห็น).

source: You are submitting a link. The key to a successful submission is interesting content and a descriptive title.
th: คุณกำลังส่งลิงค์ขึ้นไปแบ่งปันบนพิกุล กุญแจของความสำเร็จของการแบ่งปันลิงค์อยู่ที่ความน่าสนใจของเนื้อหา และข้อความพาดหัวข้อที่โดนใจ

source: You are submitting a text-based post. Speak your mind. A title is required, but expanding further in the text field is not. Beginning your title with "vote up if" is violation of intergalactic law.
th: คุณกำลังส่งกระทู้ที่เป็นข้อความขึ้น พูดสิ่งที่อยู่ในใจของคุณ ชื่อกระทู้เป็นฟิลล์ที่บังคับ, แต่ไม่ต้องใส่รายละเอียดให้ลึกมากนัก การเริ่มชื่อกระทู้ของคุณด้วย "โหวตถ้า" เป็นการผิดกฎหมายระหว่างจักรวาลนะคะ

source: Submit a new link
th: ตั้งกระทู้แบบลิงค์

source: Submit a new text post
th: ตั้งกระทู้แบบข้อความ

source: Looks like you're browsing on a small screen. Would you like to try [reddit's mobile interface](%(url)s)?
th: เหมือนกับว่าคุณกำลังพิกุลอยู่บนจอเล็ก ลองพิกุลบนโมบายไซต์ของเราสิ [Pickul mobile interface](%(url)s)?

source: we're going to need to verify your email address for you to proceed.
th: เราต้องการตรวจสอบอีเมลของคุณเพื่อดำเนินการต่อ

source: you'll be able to submit more frequently once you verify your email address
th: คุณสามารถตั้งกระทู้ได้บ่อยขึ้นถ้าคุณทำการยืนยันที่อยู่อีเมลเรียบร้อยแล้ว

source: your email address has been verfied
th: อีเมลของคุณได้ถูกยืนยันเรียบร้อย

source: Verification failed. Please try that again
th: การตรวจสอบล้มเหลว กรุณาลองใหม่อีกครั้ง

source: Our search machines are under too much load to handle your request right now. :( Sorry for the inconvenience. Try again in a little bit -- but please don't mash reload; that only makes the problem worse.
th: เครื่องจักรค้นหาของเราอยู่ในภาวะที่ทำงานหนักมาก จึงไม่สามารถตอบสนองการค้นหาของคุณได้ขณะนี้ :( ต้องขอโทษด้วยจริงๆค่ะ สักครู่กรุณาลองใหม่อีกครั้ง -- แต่ว่า อย่ากด reload รัวๆนะคะ; มันจะทำให้เครื่องจักรยิ่งทำงานหนักขึ้น

source: I couldn't understand your query, so I simplified it and searched for "%(clean_query)s" instead.
th: พิกุลไม่เข้าใจคำที่คุณค้นหาค่ะ ดังนั้นพิกุลเลยเดาว่าคุณหมายถึง "%(clean_query)s" และทำการค้นหาคำนี้แทนค่ะ

source: I couldn't understand your search query. Please try again.
th: พิกุลไม่เข้าใจคำที่คุณค้นหาค่ะ กรุณาลองใหม่อีกครั้ง

source: You may also want to check the [search help page](%(search_help)s) for more information.
th: คุณอาจจะหาข้อมูลเพิ่มได้ที่หน้า [วิธีใช้เครื่องมือค้นหา](%(search_help)s) สำหรับรายละเอียดวิธีการค้นหาทั้งหมดค่ะ

source: reddit uses a slightly-customized version of [Markdown](http://daringfireball.net/projects/markdown/syntax) for formatting. See below for some basics, or check [the commenting wiki page](/wiki/commenting) for more detailed help and solutions to common issues.
th: พิกุลใช้รุ่นที่ปรับปรุงเล็กน้อยของ [Markdown](http://daringfireball.net/projects/markdown/syntax) สำหรับการจัดรูปแบบ รายละเอียดด้านล่างเป็นตัวอย่างพื้นฐานวิธีการใช้ หรือไปที่ [the commenting wiki page](/wiki/commenting) สำหรับข้อมูลช่วยเหลือที่ลึกขึ้นและรายละเอียดวิธีการแก้ปัญหาเบื้องต้น

source: Looks like you're either a brand new user or your posts have not been doing well recently. You may have to wait a bit to post again. In the meantime feel free to [check out the reddiquette](%(reddiquette)s) or join the conversation in a different thread.
th: ดูเหมือนว่าคุณเป็นชาวพิกุลหน้าใหม่หรือกระทู้ของคุณช่วงนี้ไม่ค่อยมีใครสนใจ คุณอาจจะต้องรอสักครู่เพื่อให้สามารถตั้งกระทู้ได้ใหม่ ในระหว่างนี้คุณอาจจะอ่าน [จรรยาการเป็นชาวพิกุลที่ดี](%(reddiquette)s) หรือไปร่วมสนทนาในกระทู้อื่นๆ

source: Looks like you're either a brand new user or your posts have not been doing well recently. You may have to wait a bit to post again. In the meantime feel free to [check out the reddiquette](%(reddiquette)s), join the conversation in a different thread, or [verify your email address](%(verify)s).
th: ดูเหมือนว่าคุณเป็นชาวพิกุลหน้าใหม่หรือกระทู้ของคุณช่วงนี้ไม่ค่อยมีใครสนใจ คุณอาจจะต้องรอสักครู่เพื่อให้สามารถตั้งกระทู้ได้ใหม่ ในระหว่างนี้คุณอาจจะอ่าน [จรรยาการเป็นชาวพิกุลที่ดี](%(reddiquette)s) หรือไปร่วมสนทนาในกระทู้อื่นๆ หรือ [ทำการยืนยันอีเมลของคุณ](%(verify)s).

source: reddit is in "emergency read-only mode" right now. :( you won't be able to log in. we're sorry, and are working frantically to fix the problem.
th: ขณะนี้พิกุลอยู่ในโหมดฉุกเฉิน "อ่านอย่างเดียว". :( คุณจึงไม่สามารถเข้าสู่ระบบได้ ต้องขออภัยด้วยค่ะ ทีมงานกำลังทำงานหนักกว่ารัฐบาลเพื่อแก้ปัญหานี้ค่ะ

source: this page is temporarily in read-only mode due to heavy traffic.
th: หน้านี้อยู่ในโหมดอ่านอย่างเดียวเป็นการชั่วคราวค่ะ เนื่องจากมีผู้ใช้งานเป็นจำนวนมาก

source: Being a reddit gold member gives you access to a bunch of new site features and other benefits. Be sure to check out the new options in the gold box at the bottom of [your preferences page](/prefs), and take a look at [the about gold page](/gold/about) to see what else is available!
th: การมีบรรณาศักดิ์เป็นพิกุลทองจะช่วยให้คุณสามารถเข้าถึงความสามารถใหม่ๆของพิกุลก่อนใคร และยังมีสิทธิประโยชน์อีกมากมาย อย่าลืมไปเยี่ยมชมตัวเลือกใหม่ๆในกล่องทองที่ข้างล่างของ [หน้าตั้งค่าส่วนตัว](/prefs) และเยี่ยมชมหน้า [เกี่ยวกับเหรียญทองพิกุล](/gold/about) เผื่อพิกุลมีข้อเสนอใหม่ๆมาให้คุณ!

source: please grab a drink and join us in [the lounge](%(link)s).
th: กรุณาหยิบเครื่องดื่มและมาร่วมสนทนากับเราใน [ห้องพิกุลทอง](%(link)s)

source: You sent us a postcard! (Or something similar.) When we run out of room on our refrigerator, we might one day auction off the stuff that people sent in. Is it okay if we include your thing?
th: เราได้รับไปรณียบัตรของคุณแล้ว! (หรืออะไรก็ตามที่ดูคล้ายๆ) วันหนึ่งถ้าพื้นที่บนตู้เย็นเราไม่เหลือแล้วเราอาจจะทำการประมูลสิ่งของที่ชาวพิกุลส่งมาให้เรา จะโอเคไหมถ้าเราเอาของของคุณไปประมูลด้วย?

source: Sorry, the maximum number of comments is %(max)d. (However, if you subscribe to reddit gold, it goes up to %(goldmax)d.)
th: ขออภัยค่ะ, จำนวนความคิดเห็นสูงสุดคือ %(max)d (อย่างไรก็ตาม ถ้าคุณมีบรรณาศักดิ์เป็นระดับพิกุลทอง จำนวนความคิดเห็นสูงสุดจะเป็น %(goldmax)d.)

source: Sorry, the maximum number of comments is %d.
th: ขอโทษค่ะ จำนวนความคิดเห็นสูงสุดคือ %d

source: %(sender)s just sent you %(amount)s of reddit gold! Wasn't that nice?
th: %(sender)s เพิ่งส่งเหรียญพิกุลทองจำนวน %(amount)s มาให้คุณ! ดีจังเลยค่ะ

source: Here's a note that was included: ----
th: นี่คือข้อความที่ฝากมาด้วย: ----

source: A redditor liked [your comment](%(url)s) so much, they gave you a month of reddit gold. Shiny!
th: มีชาวพิกุลที่ชอบ[ความคิดเห็นของคุณ](%(url)s)มาก ถึงระดับที่เขาได้มอบดอกพิกุลทองให้แก่ท่าน ขอแสดงความชื่นชมด้วยค่ะ

source: You're about to set up an ongoing, autorenewing subscription to reddit gold for yourself (%(user)s).
th: คุณกำลังเลื่อนขั้นเป็นชาวพิกุลทองโดยใช้ระบบต่ออายุอัตโนมัติสำหรับตัวคุณเอง (%(user)s)

source: You're about to make a one-time purchase of %(amount)s of reddit gold for yourself (%(user)s).
th: คุณกำลังจะซื้อดอกพิกุลทองจำนวน %(amount)s สำหรับไว้ใช้เอง​ (%(user)s)

source: You're about to purchase %(amount)s of reddit gold creddits. They work like gift certificates: each creddit you have will allow you to give one month of reddit gold to someone else.
th: คุณกำลังจะซื้อดอกพิกุลทองจำนวน %(amount)s ดอกพิกุลทองทำงานเหมือนเป็นบัตรกำนันแต่ละดอกนั้นจะมีสิทธิให้คุณมอบดอกพิกุลทองให้กับผู้ใช้ท่านอื่นได้

source: You're about to give %(amount)s of reddit gold to %(recipient)s, who will be told that it came from you.
th: คุณกำลังมอบดอกพิกุลทองจำนวน %(amount)s ให้กับ %(recipient)sซึ่งจะแสดงว่าคุณเป็นคนมอบให้

source: You're about to give %(amount)s of reddit gold to %(recipient)s. It will be an anonymous gift.
th: คุณกำลังมอบดอกพิกุลทองจำนวน %(amount)s ให้แก่​ %(recipient)sซึ่งจะเป็นของขวัญนิรนาม

source: Want to say thanks to *%(recipient)s* for this comment? Give them a month of [reddit gold](/gold/about).
th: อยากจะแสดงความขอบคุณกับ *%(recipient)s* สำหรับความเห็นนี้? มอบ[ดอกพิกุลทอง](/gold/about)เป็นเวลาหนึ่งเดือนให้กับเขาสิ

source: Give *%(recipient)s* a month of [reddit gold](/gold/about) for this comment:
th: มอบ *%(recipient)s* [ดอกพิกุลทอง](/gold/about) ให้เป็นเวลาหนึ่งเดือนสำหรับความคิดเห็นนี้:

source: sorry, this has been archived and can no longer be voted on
th: ขออภัยค่ะ กระทู้นี้ได้ถูกเก็บเข้าคลังและไม่สามารถโหวตได้แล้ว

source: This page shows a history of recent activity on your account. If you notice unusual activity, you should change your password immediately. Location information is guessed from your computer's IP address and may be wildly wrong, especially for visits from mobile devices. Note: due to a bug, private-use addresses (starting with 10.) sometimes show up erroneously in this list after regular use of the site.
th: หน้านี้จะทำการแสดงประวัติของการเคลื่อนไหวของบัญชีของคุณ ถ้าคุณสังเกตุเห็นถึงความเคลื่อนไหวผิดปกติ คุณควรจะเปลี่ยนรหัสผ่านทันที ข้อมูลสถานที่ที่เราเดาจาก IP address ของคุณอาจจะผิดพลาดได้โดยเฉพาะเวลาที่คุณเยี่ยมชมผ่านทางอุปกรณ์มือถือ หมายเหตุ: เนื่องจากบ๊คของ private-use adress บางครั้งอาจจะแสดงผลผิดพลาดจากการเยี่ยมชมพิกุลตามปกติ

source: You are currently accessing reddit from this IP address: %(address)s.
th: คุณกำลังใช้งานพิกุลด้วงย IP address นี้: %(address)s

source: These apps are authorized to access your account. Logging out of all sessions will revoke access from all apps. You may also revoke access from individual apps below.
th: โปรแกรมเหล่านี้ได้ถูกอนุมัติให้ใช้บัญชีผู้ใช้ของคุณ การลงชื่อออกจากการใช้งานทั้งหมดจะยกเลิกสิทธิการเข้าถึงจากโปรแกรมทุกตัว หรือคุณสามารถยกเลิกสิทธิการเข้าถึงจากแต่ละโปรแกรมได้ข้างล่างข้อความนี้

source: Below you will see your promotion's impression and click traffic per hour of promotion. Please note that these traffic totals will lag behind by two to three hours, and that daily totals will be preliminary until 24 hours after the link has finished its run.
th: ข้างล่างข้อความนี้ คุณจะเห็น impression และ click traffic ต่อชั่วโมง ของโปรโมชั่นของคุณโปรดทราบว่า traffic เหล่านี้จะช้ากว่าข้อมูลจริงเป็นเวลา สองถึงสามชั่วโมง และยอดรวมต่อวันจะเป็นทางการ 24 ชั่วโมงหลังจากที่ลิงค์ได้ถูกโปรโมทเสร็จแล้ว

source: Traffic processing is currently running slow. The latest data available is from %(date)s. This page will be updated as new data becomes available.
th: การประมวล traffic เกิดการล่าช้า ข้อมูลล่าสุดที่สามารถดูได้คือเมื่อ​ %(date)s หน้านี้จะทำการอัพเดทเมื่อข้อมูลใหม่ถูกประมวลเสร็จแล้ว

source: Traffic processing occurs on an hourly basis. The latest data available is from %(date)s. This page will be updated as new data becomes available.
th: traffci จะทำการคำนวนทุกๆชั่วโมง. ข้อมูลล่าสุดที่สามารถดูได้คือเมื่อ %(date)s หน้านี้จะทำการอัพเดทเมื่อข้อมูลใหม่ถูกประมวลเสร็จแล้ว

source: Below are the traffic statistics for your subreddit. Each graph represents one of the following over the interval specified.* **pageviews** are all hits to %(subreddit)s, including both listing pages and comment pages.* **uniques** are the total number of unique visitors (determined by a combination of their IP address and User Agent string) that generate the above pageviews. This is independent of whether or not they are logged in.* **subscriptions** is the number of new subscriptions that have been generated in a given day. This number is less accurate than the first two metrics, as, though we can track new subscriptions, we have no way to track unsubscriptions.Note: there are a couple of places outside of your subreddit where someone can click "subscribe", so it is possible (though unlikely) that the subscription count can exceed the unique count on a given day.
th: ข้อความข้างล่างคือสถิติ traffic กลีบพิกุลของคุณ แต่ละกราฟแสดงหนึ่งในสิ่งเหล่านี้ต่อระยะเวลาที่กำหนด* **pageviews** คือจำนวนการกดทั้งหมดที่เข้ามายัง %(subreddit)s รวมไปถึงหน้ารายการ และหน้าความคิดเห็น* **uniques** คือจำนวนของ unique visitors (ซึ่งวัดจากสองอย่างคือ IP address กับ User Agent) ที่ได้มาจาก pageviews ข้างบนระบบนี้ไม่นับว่าผู้ใช้จะลงชื่อเข้าใช้หรือไม่* **subscriptions** คือจำนวนผู้ติดตามใหม่ที่เข้ามาแต่ละวันตามที่กำหนด ตัวเลขนี้จะมีความแม่นยำน้อยกว่าตัววัดสองตัวข้างบัน แต่อย่างเราก็ตามเราสามารถเช็คจำนวนผู้ติดตามใหม่ได้ แต่เราไม่สามารถติดตามจำนวนการเลิกติดตามได้หมายเหตุ: มีบางที่นอกเหนือจากพิกุลที่สามารถให้ผู้ใช้กดติดตามกลีบพิกุลได้ ดังนั้นจึงมีคามเป็นไปได้ว่า จำนวนผู้ติดตามอาจจะมากกว่าที่เราสามารถติดตามได้ในวันนั้นๆ

source: go
th: ไปเลย!

source: view subreddit traffic
th: ดู​ traffic ของกลีบพิกุล

source: an error occurred (status: %(status)s)
th: มีปัญหาเกิดขึ้นค่ะ (สถานะ: %(status)s)

source: an error occurred. please try again later! (status: %(status)s)
th: มีปัญหาเกิดขึ้นค่ะ กรุณาลองอีกครั้ง! (สถานะ: %(status)s)

source: please wait a few seconds and try again.
th: โปรดรอซักครู่แล้วลองอีกครั้ง

source: multireddit of your subscriptions
th: กลีบพิกุลที่คุณติดตามอยู่

source: multireddit of subreddits you moderate
th: กลีบพิกุลที่คุณดูแลอยู่

source: /r/all displays content from all of reddit, including subreddits you aren't subscribed to.
th: /r/all แสดงเนื้อหาสรรพสิ่งจากพิกุล รวมไปถึงกลีบพิกุลที่คุณไม่ได้ติดตามอยู่ด้วย

source: Displaying content from /r/all of reddit, except the following subreddits:
th: กำลังแสดงเนื้อหาจาก /r/สรรพสิ่ง ของพิกุล ยกเว้น กลีบพิกุลเหล่านี้:

source: Filtering /r/all is a feature only available to [reddit gold](/gold/about) subscribers. Displaying unfiltered results from /r/all.
th: กรอง /r/สรรพสิ่ง เป็น feature ที่มีเฉพาะสำหรับ [ชาวพิกุลทอง](/gold/about)เท่านั้น กำลังแสดง /r/สรรพสิ่ง แบบปกติ

source: missing name
th: ไม่มีชื่อ

source: invalid credit card number
th: เลขบัตรเครดิตไม่ถูกต้อง

source: invalid expiration date
th: วันหมดอายุไม่ถูกต้อง

source: invalid cvc
th: cvc ไม่ถูกต้อง

source: missing address
th: ไม่มีที่อยู่

source: missing city
th: ไม่มีจังหวัด

source: missing state or province
th: ไม่มีจังหวัด

source: missing country
th: ไม่มีประเทศ

source: missing zip code
th: ไม่มีรหัสไปรษณีย์

source: full permissions
th: ได้รับอำนาจเต็มที่

source: no permissions
th: ไม่มีอำนาจ

source: comment
th: ความคิดเห็น

source: point
th: คะแนน

source: link
th: ลิ้งค์

source: message
th: ข้อความ

source: subreddit
th: กลีบพิกุล

source: creddit
th: ดอกพิกุลทอง

source: reader
th: ผู้อ่าน

source: subscriber
th: ผู้ติดตาม

source: approved submitter
th: ผู้ที่ได้รับอนุญาติให้ตั้งกระทู้

source: moderator
th: ผู้ดูแล

source: user here now
th: ผู้ใช้ ณ ตอนนี้

source: milliseconds
th: เสี้ยววินาที

source: second
th: วินาที

source: minute
th: นาที

source: hour
th: ชั่วโมง

source: month
th: เดือน

source: year
th: ปี

source: invitation to moderate %(url)s
th: เชิญชวนให้มาดูแล %(url)s

source: **gadzooks! you are invited to become a moderator of [%(title)s](%(url)s)!** *to accept*, visit the [moderators page for %(url)s](%(url)s/about/moderators) and click "accept". *otherwise,* if you did not expect to receive this, you can simply ignore this invitation or report it.
th: **เย้! คุณได้ถูกเชิญให้เป็นผู้ดูแลของ [%(title)s](%(url)s)!** *ถ้าต้องการตอบรับ* โปรดเข้าไปเยี่ยม [หน้าผู้ดูแลของ %(url)s](%(url)s/about/moderators) และกด "ตอบรับ" *ไม่เช่นนั้น* ถ้าคุณไม่ได้รอคำเชิญนี้ คุณสามารถปล่อยมันทิ้งไว้ หรือรายงานเราได้

source: moderator invited
th: ผู้ดูแลได้ถูกเชิญแล้ว

source: %(user)s has been invited by %(author)s to moderate %(url)s.
th: %(user)s ได้ถูกเชิญชวนโดน %(author)s ให้มาดูแล %(url)s

source: moderator added
th: เพิ่มผู้ดูแลแล้ว

source: %(user)s has accepted an invitation to become moderator of %(url)s.
th: %(user)s ได้ตอบรับการเชิญชวนให้มาเป็นผู้ดูแลของ %(url)s

source: you are an approved submitter
th: คุณเป็นผู้ได้รับอนุญาติในการตั้งกระทู้

source: you have been added as an approved submitter to [%(title)s](%(url)s).
th: คุณได้ถูกเพิ่มรายชื่อในผู้ที่ได้รับอนุญาติให้ตั้งกระทู้ยัง [%(title)s](%(url)s)

source: you've been banned
th: คุณได้ถูกแบนแล้ว

source: you have been banned from posting to [%(title)s](%(url)s).
th: คุณได้ถูกแบนจากการตั้งกระทู้บน [%(title)s](%(url)s)

source: you can view traffic on a promoted link
th: คุณสามารถอ่าน traffic บนลิงค์ที่โปรโมทได้

source: you have been added to the list of users able to see [traffic for the sponsored link "%(title)s"](%(traffic_url)s).
th: คุณได้ถูกเพิ่มเข้าไปในรายชื่อของผู้ใช้ที่สามารถมองเห็น [trafficของ link ผู้สนับสนุน "%(title)s"](%(traffic_url)s)

source: fetching title...
th: กำลังดึงหัวข้ออยู่...

source: loading...
th: กำลังโหลด...

source: comment {verb}
th: ความคิดเห็น

source: friend
th: เพื่อน

source: submitter
th: ผู้ตั้งกระทู้

source: reddit admin, speaking officially
th: admin พิกุล กล่าวประกาศอย่างเป็นทางการ

source: %d %b %Y
th: %d/%m/%Y

source: imgur.com domain listings (including this one) are currently disabled to speed up vote processing.
th: imgur.com domain listing ตอนนี้ถูกระงับการใช้งานเพื่อเพิ่มระบบการโหวต

source: wiki tools
th: tool ของ wiki

source: moderation tools
th: tool ของผู้ดูแล

source: this subreddit is archived and no longer accepting submissions.
th: กลีบพิกุลนี้ได้ถูกเก็บเข้าคลังและไม่รับการตั้งกระทู้ใหม่แล้ว

source: Submissions disabled
th: ระบบการตั้งกระทู้ถูกปิดอยู่

source: submission in this subreddit is restricted to approved submitters.
th: การตั้งกระทู้ในกลีบพิกุลนี้ถูกจำกัดไว้แค่ผู้ที่ได้รับอนุญาติเท่านั้น

source: Submissions restricted
th: จำกัดการตั้งกระทู้

source: these subreddits
th: กลีบพิกุลเหล่านี้

source: Create your own subreddit
th: สร้างกลีบพิกุลของคุณ

source: message the admins
th: ส่งข้อความหา admin

source: message the moderators
th: ส่งข้อความหาผู้ดูแล

source: moderators
th: ผู้ดูแล

source: Recently viewed links
th: ลิงค์ที่คุณพึ่งเยี่ยมชม

source: turn admin off
th: ปิดระบบ admin

source: turn admin on
th: เปิดระบบ admin

source: FAQ
th: คำถามที่ถามบ่อยๆ

source: reddiquette
th: จริยธรรมการเป็นชาวพิกุลที่ดี

source: tools
th: เครื่องมือ

source: redditgifts
th: พิกุลแลกของขวัญ

source: reddit.tv
th: pickul.tv

source: radio reddit
th: พิกุลเรดิโอ

source: %(site)s mail
th: %(site)s จดหมาย

source: login or register
th: เข้าสู่ระบบ/สมัครสมาชิก

source: request for permission
th: ขอสิทธิการเข้าถึง

source: bummer
th: แหม เสียดายจัง

source: this page is no longer available due to a copyright claim.
th: หน้านี้ไม่มีอยู่แล้วเนื่องจากมีปัญหาเกี่ยวกับลิขสิทธิ

source: about %(site)s
th: เกี่ยวกับ %(site)s

source: search subreddits by name
th: ค้นหากลีบพิกุลด้วยชื่อ

source: your front page subreddits (%s)
th: หน้าแรกกลีบพิกุลของคุณ (%s)

source: what's this?
th: นี่คืออะไร?

source: trophy case
th: ตู้เก็บถ้วยรางวัล

source: an unknown amount
th: ไม่ทราบจำนวนที่แน่นอน

source: less than a day
th: น้อยกว่าหนึ่งวัน

source: %(creddits)s gold creddit to give
th: %(creddits)s ดอกพิกุลทองที่คุณมอบได้

source: give reddit gold to %(user)s to show your appreciation
th: มอบดอกพิกุลทองให้ %(user)s เพื่อแสดงความชื่นชมแก่เขา

source: renew your reddit gold
th: ต่อบรรณาศักดิ์พิกุลทอง

source: get extra features and help support reddit with a reddit gold subscription
th: ใช้ feature เพิ่ม และช่วยสนับสนุนพิกุล ด้วยการเป็นชาวพิกุลทอง

source: reddit is a platform for internet communities
th: พิกุลคือเวทีชุมชนบนอินเตอร์เนท

source: where your votes shape what the world is talking about.
th: ที่ๆคะแนนโหวตของคุณจะสร้างสรรค์โลกที่พวกเราต้องการจะให้เป็น

source: %s visible
th: %s มองเห็นได้

source: %(bonus)s bonus subreddits
th: %(bonus)s bonus กลีบพิกุล

source: try entering those letters again
th: ลองใส่ตัวอักษรพวกนั้นใหม่นะคะ

source: previous search
th: การค้นหาครั้งที่แล้ว

source: %(site_title)s via %(domain)s
th: %(site_title)s ทาง ​%(domain)s

source: grant flair
th: มอบไอคอน

source: user flair templates
th: template ไอคอนผู้ใช้

source: link flair templates
th: template ลิงค์ไอคอน

source: user
th: ผู้ใช้

source: note
th: หมายเหตุ

source: friendship
th: เพื่อน

source: add a friend
th: เพิ่มเป็นเพื่อนของคุณ

source: your friends
th: เพื่อนของคุณ

source: blocked users
th: ผู้ใช้ที่ถูกบล๊อค

source: add approved submitter
th: เพิ่มผู้สร้างกระทู้

source: approved submitters for %(reddit)s
th: อนุมัติผู้สร้างกระทู้สำหรับ %(reddit)s แล้ว

source: add moderator
th: เพิ่มผู้ดูแล

source: invite moderator
th: เชิญชวนให้เป็นผู้ดูแล

source: you are a moderator of this subreddit. %(action)s
th: คุณเป็นผู้ดูแลของกลีบพิกุลนี้ ​%(action)s

source: moderators of /r/%(reddit)s
th: ผู้ดูแลของ /r/%(reddit)s

source: invited
th: เชิญชวนแล้ว

source: banned users
th: ผู้ใช้ที่ถูกแบน

source: add a wiki contributor
th: เพิ่มผู้มีส่วนร่วมการแก้ไข

source: wiki page contributors
th: ผู้มีส่วนร่วมการแก้ไขหน้า wiki

source: cost per 1k impressions ($%(avg).2f average)
th: ราคาต่อ 1000 impression (฿%(avg).2f โดยเฉลี่ย)

source: cost per click ($%(avg).2f average)
th: ราคาต่อการกด (฿%(avg).2f โดยเฉลี่ย)

source: historical performance
th: ประวัติการเคลื่อนไหว

source: account activity
th: การเคลื่อนไหวของบัญชีผู้ใช้

source: uniques by %s
th: จำนวน unique ตาม ​%s

source: uniques
th: จำนวน unique

source: pageviews by %s
th: pageviews ตาม %s

source: traffic by %s
th: traffic ตาม %s

source: [frontpage]
th: [หน้าแรก]

source: total impressions by day
th: ยอด impressions ตามวัน

source: total clicks by day
th: ยอดการกดตามวัน

source: clicks
th: จำนวนการกด

source: ad totals
th: จำนวนโฆษณารวม

source: frontpage
th: หน้าแรก

source: impressions by %s
th: impressions ตาม %s

source: unique clicks
th: unique การกด

source: clicks by %s
th: จำนวนการกดตาม %s

source: total clicks
th: ยอดการกด

source: subscriptions by day
th: ผู้ติดตามโดยวัน

source: subscriptions
th: ผู้ติดตาม

source: date and time (UTC)
th: เวลาและวันทืี่ (+7 GMT)

source: total impressions
th: ยอด impressions

source: total click-through rate (%)
th: ยอดรวม click-through rate (%)

source: share traffic
th: แชร์ traffic

source: current viewers
th: ผู้ชม ณ ตอนนี้

source: view
th: จำนวนผู้ชม

source: edit
th: การแก้ไข

source: history
th: ประวัติ

source: talk
th: พูดคุย

source: settings
th: การตั้งค่า

source: this wiki is currently disabled, only mods may interact with this wiki
th: หน้านี้ถูกระงับการใช้งาน

source: this page is empty, edit it to add some content.
th: หน้านี้ว่างอยู่ แก้ไขเพื่อเพิ่มหน้านี้ลงไป

source: page %s does not exist in this subreddit
th: หน้า %s ไม่มีอยู่บนกลีบพิกุลนี้

source: editing
th: กำลังแก้ไข

source: This page is restricted, only moderators may edit it.
th: หน้านี้ถูกจำกัดการแก้ไขไว้ ผู้ดูแลสามารถแก้ไขได้เท่านั้น

source: revisions
th: การแก้ไข

source: Viewing recent revisions for /r/%s
th: กำลังอ่านการแก้ไขล่าสุดของ /r/%s

source: Viewing pages for /r/%s
th: กำลังอ่านหน้าของ /r/%s
