Repository: eakkew/pickul-i18n
Catalog: reddit_i18n/*/LC_MESSAGES/r2.po
Languages: th

source: Below is a list of pages in this wiki visible to you in this subreddit.
th: ข้างล่างข้อความนี้คือรายกาาของหน้าบน wiki ของกลีบพิกุลที่คุณสามารถอ่านได้

source: discussions
th: กระทู้แสดงความคิดเห็น

source: Discussions are site-wide links to this wiki page.
th: ลิงค์การแสดงความคิดเห็นของหน้า wiki นี้สามารถเข้าถึงได้ทุกคน

source: Submit a link to this wiki page or see other discussions about this wiki page.
th: ส่งลิงค์ไปยังหน้า wiki นี้หรือดูกระทู้เกี่ยวกับหน้า wiki นี้

source: %(min)d to any
th: %(min)d ถึง เท่าไหร่ก็ได้

source: any to %(max)d
th: เท่าไหร่ก็ได้ ถึง %(max)d

source: %(min)d to %(max)d
th: %(min)d ถึง​ %(max)d

source: please provide a first name
th: โปรดใส่ชื่อจริง

source: please provide a last name
th: โปรดใส่นามสกุล

source: please provide an address
th: โปรดใส่ที่อยู่

source: please provide your city
th: โปรดใส่จังหวัด

source: please provide your state
th: โปรดใส่เขต

source: please provide your zip or post code
th: โปรดใส่รหัสไปรษณีย์

source: please pick a country
th: โปรดเลือกประเทศ

source: Our ToS don't cover your country (yet). Sorry.
th: ข้อตกลงการใช้งานของเราไม่ครอบคุมถึงประเทศของคุณ ขออภัยด้วยค่ะ

source: max length %d characters
th: จำนวนตัวอักษรสูงสุด %d ตัว

source: credit card numbers should be 13 to 16 digits
th: เลขเครดิตการ์ดต้องมี 13 หรือ 16 ตัว

source: dates should be YYYY-MM
th: วันที่ควรจะเป็นรูปแบบ YYYY-MM

source: month must be in the range 01..12
th: เดือนต้องอยู่ในเลข 01 ถึง 12

source: expiration date must be in the future
th: วันที่หมดอายุต้องไม่หมดอายุแล้ว

source: card verification codes should be 3 or 4 digits
th: รหัสการยืนยันบัตรควรจะมี 3 หรือ 4 ตัวเลข

source: an app
th: โปรแกรม

source: an app developed by the user
th: โปรแกรมที่ถูกพัฒนาโดยผู้ใช้

source: the name of an existing wiki page
th: ชื่อของหน้า wiki ที่มีอยู่แล้ว

source: a wiki revision ID
th: id การปรับปรุงหน้า wiki

source: the name of an existing page or a new page to create
th: ชื่อของหน้าที่มีอยู่แล้วหรือหน้าใหม่เพื่อสร้าง

source: the starting point revision for this edit
th: จุดเริ่มต้อนการปรับปรุงของการแก้ไขนี้

source: ancient history
th: อดีตชาติก่อน

source: really obscure karma from before it was cool to track per-subreddit
th: คะแนนไร้สาระก่อนที่มันจะฮิตที่จะวัดจากแต่ละกลีบพิกุล

source: moderator of /r/%(reddit)s, speaking officially
th: ผู้ดูแลของ /r/%(reddit)s ประกาศอย่างเป็นทางการ

source: approved by %s
th: อนุมัติโดย %s

source: approved by a moderator
th: อนุมัติโดยผู้ดูแลแล้ว

source: by %(author)s to %(reddit)s
th: โดย %(author)s บน %(reddit)s

source: by %(author)s
th: โดย %(author)s

source: %(score)s submitted %(when)s ago%(lastedited)s
th: %(score)s ตั้งเมื่อ %(when)s ที่แล้ว​%(lastedited)s

source: submitted %(when)s ago%(lastedited)s by %(author)s to %(reddit)s
th: ตั้งเมื่อ %(when)s ที่แล้ว%(lastedited)s โดย %(author)s บน %(reddit)s

source: submitted %(when)s ago%(lastedited)s by %(author)s
th: ตั้งเมื่อ %(when)s ที่แล้ว%(lastedited)s โดย %(author)s

source: %(score)s submitted %(when)s ago
th: %(score)s ส่งเมื่อ %(when)s ที่แล้ว

source: submitted %(when)s ago by %(author)s to %(reddit)s
th: ตั้งเมื่อ %(when)s ที่แล้วโดย %(author)s บน %(reddit)s

source: submitted %(when)s ago by %(author)s
th: ตั้งเมื่อ %(when)s ที่แล้วโดย %(author)s

source: [deleted]
th: [หายสาบสูญ]

source: a redditor gifted you a month of reddit gold for this comment.
th: ชาวพิกุลทองได้มอบพิกุลทองเป็นเวลาหนึ่งเดือนสำหรับความเห็นนี้

source: you have gifted reddit gold to %(recipient)s for this comment.
th: คุณได้รับมอบพิกุลทองจาก %(recipient)s สำหรับความเห็นนี้

source: a redditor has gifted reddit gold to %(recipient)s for this comment.
th: ชาวพิกุลได้มอบดอกพิกุลทองให้ %(recipient)s สำหรับความเห็นนี้

source: comment score below threshold
th: คะแนนความคิดเห็นที่น้อยกว่าเกณฑ์

source: blocked user
th: ผู้ใช้ที่ถูกบล๊อค

source: comment reply
th: ความคิดเห็นโต้ตอบ

source: post reply
th: ส่งข้อความตอบกลับ

source: [message from blocked user]
th: [ข้อความจากผู้ใช้ที่ถูกบล๊อค]

source: [unblock user to see this message]
th: [ยกเลิกการบล๊อคผู้ใช้เพื่ออ่านข้อความนี้]

source: subreddit message %(author)s sent %(when)s ago
th: ข้อความบนกลีบพิกุลจาก %(author)s ส่งเมื่อ %(when)s ที่แล้ว

source: to %(dest)s sent %(when)s ago
th: ถึง %(dest)s ส่งเมื่อ %(when)s ที่แล้ว

source: from %(author)s sent %(when)s ago
th: จาก %(author)s ส่งเมื่อ %(when)s ที่แล้ว

source: to %(dest)s from %(author)s sent %(when)s ago
th: ถึง %(dest)s จาก %(author)s ส่งเมื่อ %(when)s ที่แล้ว

source: via %(subreddit)s
th: ผ่านทาง %(subreddit)s

source: %(author)s via %(subreddit)s
th: %(author)s ผ่านทาง %(subreddit)s

source: [reddit] %(user)s has shared a link with you
th: [พิกุล] %(user)s ได้แชร์ลิงค์ให้กับคุณ

source: [feedback] feedback from '%(user)s'
th: [เสียงตอบรับ] เสียงตอบรับจากผู้ใช้ '%(user)s'

source: [ad_inq] feedback from '%(user)s'
th: [โฆษณา] เสียงตอบรับจากผู้ใช้ '%s(user)s'

source: [reddit] email removal notice
th: [พิกุล] แจ้งการลบอีเมล์ออก

source: [reddit] email addition notice
th: [พิกุล] แจ้งการเพิ่มอีเมล์

source: [reddit] reset your password
th: [พิกุล] ตั้งรหัสผ่านใหม่

source: [reddit] verify your email address
th: [พิกุล] กรุณายืนยันอีเมล์ของคุณ

source: [reddit] your bid has been accepted
th: [พิกุล] การประมูลของคุณได้ถูกอนุมัติแล้ว

source: [reddit] your promotion has been accepted
th: [พิกุล] โปรโมชั่นของคุณได้ถูกอนุมัติแล้ว

source: [reddit] your promotion has been rejected
th: [พิกุล] โปรโมชั่นของคุณถูกปฏิเสธ

source: [reddit] your promotion has been charged
th: [พิกุล] โปรโมชั่นของคุณได้ถูกคิดเงินแล้ว

source: [reddit] your promotion is now live
th: [พิกุล] โปรโมชั่นของคุณได้เริ่มแล้ว

source: [reddit] your promotion has finished
th: [พิกุล] โปรโมชั่นของคุณได้จบลงแล้ว

source: [reddit] your promotion has been created
th: [พิกุล] โปรโมชั่นของคุณได้ถูกสร้างแล้ว

source: [reddit] hey, nerd!
th: [พิกุล] คุณนายครับ

source: [reddit] reddit gold activation link
th: [พิกุล] ลิงค์ไปยังหน้า 'ใช้ดอกพิกุลทอง'

source: ban user
th: แบนผู้ใช้

source: unban user
th: ยกเลิกการแบนผู้ใช้

source: remove post
th: ลบกระทู้

source: approve post
th: อนุมัติกระทู้

source: remove comment
th: ลบความคิดเห็น

source: approve comment
th: อนุมัติความคิดเห็น

source: remove moderator
th: ปลดสิทธิผู้ดูแล

source: uninvite moderator
th: ยกเลิกการเชิญเป็นผู้ดูแล

source: accept moderator invite
th: ตอบรับการเป็นผูดูแล

source: add contributor
th: เพิ่มผู้มีสิทธิแก้ไข

source: remove contributor
th: ปลดผู้มีสิทธิแก้ไข

source: edit settings
th: แก้ไขการตั้งค่า

source: distinguish
th: จำแนก

source: mark nsfw
th: ตั้งให้เป็นหน้าที่ไม่ปลอดภัยสำหรับที่สาธารณะ

source: ban from wiki
th: แบนจากวิกิ

source: unban from wiki
th: ยกเลิกการแบนบน wiki

source: add wiki contributor
th: เพิ่มผู้มีสิทธิในการแก้ไข

source: remove wiki contributor
th: ปลดสิทธิการแก้ไขของผู้่ใช้

source: wiki revise page
th: หน้ากันตรวจทาน wiki

source: wiki page permissions
th: สิทธิการแก้ไขบนหน้า wiki

source: ignore reports
th: เมินรายงาน

source: unignore reports
th: ยกเลิกการเมินรายงาน

source: permissions
th: สิทธิการเข้าถึง

source: banned
th: แบนแล้ว

source: wiki banned
th: แบนจากวิกิแล้ว

source: unbanned from wiki
th: ยกเลิกการแบนจากวิกิ

source: added wiki contributor
th: เพิ่มผู้มีสิทธิแก้ไข wiki

source: removed wiki contributor
th: ปลดสถานะผู้มีสิทธิแก้ไข wiki แล้ว

source: unbanned
th: ยกเลิกการแบนแล้ว

source: removed
th: ลบออกแล้ว

source: approved
th: อนุมัติแล้ว

source: added moderator
th: เพิ่มผู้ดูแลแล้ว

source: removed moderator
th: ปลดสถานะผู้ดูแลแล้ว

source: invited moderator
th: ชวนให้เป็นผู้ดูแลแล้ว

source: uninvited moderator
th: ยกเลิกการเชิญชวนให้เป็นผู้ดูแลแล้ว

source: accepted moderator invitation
th: รับการเชิญชวนให้เป็นผู้ดูแลแล้ว

source: added approved contributor
th: เพิ่มผู้มีสิทธิโพสแล้ว

source: removed approved contributor
th: ลบผู้มีสิทธิโพสออกแล้ว

source: edited settings
th: แก้ไขการตั้งค่าแล้ว

source: edited flair
th: แก้ไขไอคอนแล้ว

source: edited wiki page
th: แก้ไขหน้า wiki แล้ว

source: changed wiki page permission level
th: เปลี่ยนสิทธิการเข้าถึงของหน้าwiki

source: distinguished
th: จำแนกแล้ว

source: marked nsfw
th: ทำให้เป็นกระทู้ไม่ปลอดภัยสำหรับที่สาธารณะ

source: ignored reports
th: เมินการรายงาน

source: unignored reports
th: ยกเลิกการเมินการรายงาน

source: changed permissions on
th: เปลี่ยนการอนุญาติเมื่อ

source: confirmed ham
th: ยืนยันว่าไม่ใช่spam

source: confirmed spam
th: ยืนยันว่าเป็นspam

source: removed not spam
th: ลบกระทู้ที่ไม่ใช่spamแล้ว

source: removed spam
th: spam ถูกลบแล้ว

source: removed self
th: ลบตัวเองออก

source: title
th: ไตเติล

source: description
th: รายละเอียด

source: sidebar
th: แถบด้านข้าง

source: language
th: ภาษา

source: type
th: ประเภท

source: link type
th: ประเภทของลิงค์

source: submit link button label
th: ชื่อปุ่มการตั้งกระทู้ลิงค์

source: submit text post button label
th: ชื่อปุ่มการตั้งกระทู้ความคิดเห็น

source: toggle viewers must be over 18
th: เปิด/ปิด การเข้าชมของผู้ใช้ที่อายุต่ำกว่า​ 18

source: toggle allow in default set
th: เปิด/ปิด การอนุญาติในกลุ่มค่าเริ่มต้น

source: toggle show thumbnail images of content
th: เปิด/ปิด การแสดงรูปขนาดเล็กของกระทู้

source: toggle show sidebar from cname
th: ใช้การแสดงแถบด้านข้างจาก cname

source: toggle custom CSS from cname
th: ใช้ custom css จาก cname

source: header title
th: ข้อความบนหัวเรื่อง

source: delete header image
th: ลบรูปเฮดเดอร์

source: delete image
th: ลบรูป

source: upload header image
th: อัพโหลดเฮดเดอร์

source: upload image
th: อัพโหลดรูป

source: add/edit flair
th: เพิ่ม/แก้ ไอคอน

source: delete flair
th: ลบไอคอน

source: edit by csv
th: แก้ไขโดย csv

source: toggle flair enabled
th: เปิดการใช้งานไอคอนแล้ว

source: toggle user flair position
th: เลือกตำแหน่งไอคอนของผู้ใช้

source: toggle link flair position
th: เลือกตำแหน่งไอคอนลิงค์

source: toggle user assigned flair enabled
th: เปิดการใช้งานไอคอนที่ผู้ใช้เลือกเองแล้ว

source: toggle submitter assigned link flair enabled
th: เปิดการใช้งานระบบไอคอนของผู้ตั้งกระทู้แล้ว

source: add/edit flair templates
th: เพิ่ม/แก้ไขไอคอนเทมเพลท

source: delete flair template
th: ลบไอคอนเทมเพลท

source: clear flair templates
th: เอาไอคอนเทมเพลทออก

source: remove
th: ลบ

source: set permissions on moderator
th: ตั้งค่าการเข้าถึงของผู้ดูแล

source: set permissions on moderator invitation
th: ตั้งค่าการเข้าถึงของการเชิญผู้ดูแลเพิ่ม

source: by
th: โดย

source: on
th: เมื่อ

source: %s (filtered)
th: %s (ถูกกรองออก)

source: pickul.com
th: บอกเล่า แบ่งปัน ทุกสิ่ง

source: on reddit.com
th: บน pickul.com

source: Edit Posts
th: แก้ไขกระทู้

source: Edit and delete my comments and submissions.
th: แก้ไขและลบความคิดเห็นและกระทู้ของฉัน

source: My Identity
th: ตัวตนของฉัน

source: Access my reddit username and signup date.
th: เข้าชมชื่อผู้ใช้ของฉันและวันที่สมัคร

source: Moderate Flair
th: ดูแลไอคอน

source: Manage and assign flair in subreddits I moderate.
th: บริหารและใส่ไอคอนบนกลีบพิกุลที่ฉันดูแลอยู่

source: Moderate Posts
th: ดูแลกระทู้

source: Approve, remove, mark nsfw, and distinguish content in subreddits I moderate.
th: อนุมัติ ลบ ตั้งnsfw และจัดการเนื้อหาบนกลีบพิกุลที่ฉันดูแลอยู่

source: Moderate Subreddit Configuration
th: การตั้งค่าการดูแลของกลีบพิกุล

source: Manage the configuration, sidebar, and CSS of subreddits I moderate.
th: บริหารการตั้งค่า แถบด้านข้างและ css บนกลีบพิกุลที่ฉันดูแล

source: Moderation Log
th: บันทึกการดูแล

source: Access the moderation log in subreddits I moderate.
th: เข้าชมบันทึกการดูแลในกลีบพิกุลที่ฉันดูแล

source: Subreddit Traffic
th: traffic ของกลีบพิกุล

source: Access traffic stats in subreddits I moderate.
th: เข้าชมสถิติ traffic ในกลีบพิกุลทีฉันดูแล

source: My Subreddits
th: กลีบพิกุลของฉัน

source: Access the list of subreddits I moderate, contribute to, and subscribe to.
th: เข้าชมรายการของกลีบพิกุลที่คุณดูแล, มีส่วนร่วมและติดตามอยู่

source: Private Messages
th: ข้อความส่วนตัว

source: Access my inbox and send private messages to other users.
th: เข้าชมกล่องข้อความและส่งข้อความส่วนตัวหาผู้ใข้ท่านอื่น

source: Read Content
th: อ่านกระทู้

source: Access posts and comments through my account.
th: เข้าชมกระทู้และความคิดเห็นผ่านบัญชีของคุณ

source: Submit Content
th: ส่งเนื้อหา

source: Submit links and comments from my account.
th: ส่งลิงค์และความคิดเห็นจากบัญชีของคุณ

source: Edit My Subscriptions
th: แก้ไขการติดตามของคุณ

source: Manage my subreddit subscriptions.
th: บริหารการติดตามกลีบพิกุลของคุณ

source: Vote
th: โหวต

source: Submit and change my votes on comments and submissions.
th: ส่งและเปลี่ยนโหวตบนความคิดเห็นและกระทู้

source: status
th: สถาณะ

source: admin mode enabled
th: เปิดระบบ admin

source: admin off
th: ปิดระบบ admin

source: debug mode
th: ดีบั๊กโหมด

source: secure
th: ความปลอดภัย

source: development statics
th: สถิติการพัฒนา

source: production statics
th: สถิติของผลิตภัณฑ์

source: ads disabled
th: ปิดการใช้โฆษณา

source: captcha disabled
th: ปิดการใช้ captcha

source: ratelimit disabled
th: ปิดการใช้ ratelimit

source: hide
th: ซ่อน

source: top adverts
th: โฆษณายอดนิยม

source: ad
th: โฆษณา

source: Exclude your subscribed subreddits
th: ไม่นับรวมกลีบพิกุลที่คุณติดตาม

source: See gilded comments
th: ดูความคิดเห็นเคลือบทอง

source: you already have that trophy!
th: คุณมีถ้วยรางวัลนั้นแล้ว!

source: trophy claimed!
th: ได้รับถ้วยรางวัลแล้ว!

source: /* Custom css: use this block to insert special translation-dependent css in the page header */
th: /* Custom css: ใช้โค๊ดเหล่านี้ในการใส่ special translation-dependent css ในheader ของหน้า*/

source: links from %(site)s
th: ลิงค์จาก %(site)s

source: install the %(site)s bookmarklet set
th: ติดตั้ง %(site)s ชุด​bookmarklet

source: once added to your bookmark bar, you can click these buttons from any site to get quick access to reddit functionality.
th: เมื่อคุณเพิ่มแถบ bookmark แล้ว คุณสามารถกดปุ่มเหล่านี้จากไซท์ไหนก็ได้เพื่อที่จะเข้ามาใช้ระบบพิกุลได้ทันใจ

source: in Firefox
th: บน Firefox

source: click and drag
th: คลิกและลาก

source: to your bookmark bar.
th: เพิ่มลงไปในแถบ bookmark ของคุณ

source: in Internet Explorer
th: บน Internet Explorer

source: right-click on
th: คลิกขวาบน

source: then choose "Add to Favorites" and add to the "Links" folder.
th: ทีนี้ก็เลือก "เพิ่มลงรายการโปรด" และเพิ่มลงไปในแฟ้ม "folder"

source: in Safari
th: บน Safari

source: voila! now you have all the functionality of %(site)s in your toolbar.
th: เย้! ตอนนี้คุณสามารถใช้งาน %(site)s บนtoolbarของคุณแล้ว

source: put %(site)s buttons on your site
th: ใส่ปุ่ม %(site)s บนเวบไซต์ของคุณ

source: the reddit button is the smart way to get your content submitted to and discussed on reddit. pick the button you like from below, and then copy/paste the code into your HTML editor.
th: ปุ่มพิกุลเป็นทางเลือกพิเศษที่ คุณสามารถตั้งกระทู้และแสดงความคิดเห็นบนพิกุล เลือกปุ่มที่คุนชอบข้างล่าง แล้วcopy and paste โค๊ดไปยัง HTML editor ของคุณ

source: commonly used buttons
th: ปุ่มที่ใช้บ่อยๆ

source: use one of these buttons to quickly add reddit links to your site, or see below for more options.
th: ใช้ปุ่มเหล่านี้เพื่อใส่ ลิงค์พิกุลบนไซท์ของคุณ หรือดูข้างล่างเพื่อดูตัวเลือกเพิ่มเติม

source: buttons with points
th: ปุ่มพร้อมคะแนน

source: customizing the look of your buttons
th: ปรับรูปลักษณ์ของปุ่มของคุณ

source: the buttons with points have three additional options.
th: ปุ่มพร้อมคะแนนจะมีตัวเลือกให้อีกสามอย่าง

source: no styles will be added, so you can style it yourself
th: รูปแบบจะไม่ถูกใส่เข้าไป เพื่อที่คุณจะได้สร้างรูปแบบของปุ่มเอง

source: specify a url to use instead of the current url
th: ระบุ url ที่จะใช้แทน url ปัจจุบัน

source: opens links in a new window
th: เปิดลิงค์ในหน้าใหม่

source: Example:
th: ตัวอย่าง:

source: simple interactive button
th: ปุ่มโต้ตอบแบบง่าย

source: put this code on your page:
th: ใส่โค๊ดนี้บนหน้าของคุณ

source: and you'll get something like this:
th: และคุณจะได้ปุ่มประมาณนี้:

source: more interactive buttons
th: ดูปุ่มโต้ตอบมากกว่านี้

source: interactive button advanced settings
th: การตั้งค่าขั้นสูงของปุ่มโต้ตอบ

source: specify a url
th: ระบุ url

source: useful in places like blogs, where you want to link to the post's permalink
th: มีประโยชน์สำหรับการใช้เช่น บนblog ซึ่งคุณสามารถลิงค์โพสนั้นไปเป็น permalink

source: specify a community to target
th: ระบุเป้าหมายชุมชน

source: specify a title
th: ระบุหัวข้อกระทู้

source: open links in a new window
th: เปิดลิงค์บนหน้าใหม่

source: specify the color
th: เลือกสี

source: specify a border color
th: เลือกสีของขอบ

source: to make this button:
th: สร้างปุ่มนี้:

source: use this code:
th: ใช้รหัสนี้:

source: more badges and buttons
th: ดูตราและปุ่ม

source: view code
th: แสดงรหัส

source: hide code
th: ซ่อนรหัส

source: (sorry)
th: (ขอโทษค่ะ)

source: are you human?
th: คุณเป็นมนุษย์ใช่ไหม

source: human?
th: มนุษย์

source: clear
th: ล้าง

source: in
th: ใน

source: deleted comment from
th: ลบความคิดเห็นจาก

source: ago
th: ที่แล้ว

source: child
th: ความเห็นย่อย

source: show replies
th: แสดงข้่อความตอบรับ

source: This sidebar will automatically appear when there are comments.
th: แถบด้านข้างจะไม่ปรากฏเมื่อมีความคิดเห็น

source: This sidebar will not be shown automatically.
th: แถบด้านข้างนี้จะไม่แสดงอย่างอัตโนมัติ

source: You've been here before. To highlight comments that were posted since one of your visits, select it below:
th: คุณเคยเข้ามาหน้านี้แล้ว ถ้าคุณต้องการเน้นข้อความที่ถูกตั้งหลังจากที่คุณเข้ามาชม โปรดเลือกจากด้านล่าง

source: no highlighting
th: ไม่มีการเน้นคำ

source: # Claim this award for /u/%s? #
th: # รับรางวัลสำหรับ /u/%sเลยหรือไม่? #

source: Yes, please!
th: เอาเลย!

source: no spaces, e.g., slashdot
th: ห้ามเว้นวรรค เช่น batmanbegin

source: name
th: ชื่อ

source: e.g., slashdot: news for nerds, stuff that matters
th: เช่น drama-addict: แหล่งรวมดราม่าเด็ดๆ สดร้อนตลอดเวลา

source: publicly describe your subreddit for all to see. 500 characters max.
th: คำอธิบายกลีบพิกุลให้ผู้อื่นได้เห็น สูงสุด 500 ตัวอักษร

source: shown in the sidebar of your subreddit. 5120 characters max.
th: แสดงบนแถบด้านข้างของกลีบพิกุล สูงสุด 5120 ตัวอักษร

source: public
th: สาธารณะ

source: anyone can view and submit
th: ทุกคนสามารถอ่านและโพสได้

source: restricted
th: จำกัดการเข้าถึง

source: anyone can view, but only some are approved to submit links
th: ทุกคนสามารถอ่านห้องนี้ได้ แต่เฉพาะผู้ที่ได้รับอนุญาติเท่านั้นถึงจะโพสลิงค์ได้

source: private
th: ห้องปิด

source: only approved members can view and submit
th: สมาชิกเท่านั้ันที่สามารถิอ่านและโพสกระทู้ได้

source: archived
th: เก็บเข้าคลังไว้

source: anyone can view, but submissions are no longer accepted
th: ทุกคนสามารถอ่านได้ แต่ไม่รับการส่งโพสกระทู้แล้ว

source: content options
th: ตัวเลือกเนื้อหา

source: any
th: ทุกประเภท

source: any link type is allowed
th: ลิงค์ประเภทไหนก็ได้

source: links only
th: ลิงค์เท่านั้น

source: only links to external sites are allowed
th: อนุญาติเฉพาะลิงค์จากที่อื่น

source: text posts only
th: เฉพาะกระทู้ความคิดเห็นเท่านั้น

source: only text/self posts are allowed
th: อนุญาติเฉพาะกระทู้ความคิดเห็นเท่านั้น

source: Custom label for submit link button (blank for default):
th: ป้ายกำกับบนปุ่นสำหรับส่งลิงค์ (เว้นว่างเพื่อใช้ค่าตั้งต้น)

source: Custom label for submit text post button (blank for default):
th: ป้ายกำกับบนปุ่มสำหรับส่งกระทู้ความคิดเห็น (เว้นว่างเพื่อใช้ค่าตั้งต้น)

source: disabled
th: ปิดการใช้

source: Wiki is disabled for all users except mods
th: ผู้ใช้ทั่วไปไม่สามารถใช้ wiki ได้ ยกเว้นผู้ดูแล

source: mod editing
th: การแก้ไขโดยผู้ดูแล

source: Only mods, approved wiki contributors, or those on a page's edit list may edit
th: เฉพาะผู้ดูแล และผู้ที่ได้รับอนุญาติเท่านั้น ที่จะแก้ไขได้

source: anyone
th: ใครก็ได้

source: Anyone who can submit to the subreddit may edit
th: อนุญาติให้ทุกคนที่สามารถส่งลิงค์มาหากลีบพิกุล สามารถแก้ไขได้

source: Subreddit karma required to edit and create wiki pages:
th: กำหนดคะแนนบวกต่ำสุดที่จะแก้ไขหรือสร้างหน้า wikiได้:

source: Account age (days) required to edit and create wiki pages:
th: กำหนดอายุของการเป็นสมาชิกต่ำสุด (วัน) ถึงจะแก้และสร้างหน้า wiki ได้ :

source: other options
th: ตัวเลือกอื่นๆ

source: viewers must be over eighteen years old
th: ผู้อ่านต้องอายุมากกว่า 18 ปีขึ้นไป

source: allow this subreddit to be shown in the default set
th: อนุญาติให้กลีบพิกุลแสดงบนการตั้งค่าตั้งต้น

source: show thumbnail images of content
th: แสดงรูปขนาดเล็กของเนื้อหา

source: exclude posts by site-wide banned users from modqueue
th: ไม่รวมกระทู้ที่ถูกแบนอยู่ใน modqueue

source: make custom CSS styles apply only when accessed from the cname.
th: ใช้ custom CSS style เฉพาะเวลาที่เข้าพิกุลผ่าน cname เท่านั้น

source: show sidebar when accessed from the cname.
th: แสดงแถบด้านข้างเมื่อเข้าพิกุลผ่าน cname

source: hide help
th: ซ่อนตัวช่วยเหลือ

source: Own a domain? Enter it here and then go to your DNS provider and add a CNAME record aliasing your domain to rhs.reddit.com. You will be able to access your reddit through your domain.
th: เป็นเจ้าของ domain หรือครับ?​ ใส่ domain ที่นี่และไปยัง DNS provider ของคุณและเพิ่มCNAME ให้ aliasing domain ของคุณไปที่ rhs.pickul.com คุณจะสามารถคุณจะสามารถเข้าถึงพิกุลผ่านทาง domain ของคุณ

source: look and feel
th: รูปแบบบ

source: edit the stylesheet
th: แก้ สไตล์ชีท

source: leaves this page
th: ออกจากหน้านี้

source: restore default header
th: ปรับ header ให้กลับเป็นค่าเริ่มต้ัน

source: save options
th: ตัวเลือกการบันทึก

source: a message from the moderators of /r/%s
th: ข้อความจากผู้ดูแลของ /r/%s

source: your name
th: ชื่อของคุณ

source: (only used to reply)
th: (ใช้เพื่อการสื่อสารเท่านั้น)

source: email
th: อีเมล์

source: send
th: ส่ง

source: send reddit feedback
th: ส่งคำติแนะนำหาพิกุล

source: jump to user (or add):
th: ข้ามไปยังผู้ใช้ (หรือเพิ่ม):

source: back to full list
th: กลับไปรายการเต็ม

source: back to the beginning
th: กลับไปที่หัวข้อ

source: flair text
th: ข้อความไอคอน

source: css class
th: css calss

source: save
th: บันทึก

source: prev
th: ก่อนหน้่า

source: next
th: ถัดไป

source: flair settings
th: การตั้งค่าเกี่ยวกับไอคอน

source: flair options
th: ตัวเลือกเกี่ยวกับไอคอน

source: enable user flair in this subreddit
th: เปิดการใช้งานไอคอนในกลีบพิกุลนี้

source: allow users to assign their own flair
th: อนุญาติให้ผู้ใช้กำหนดไอคอนของตัวเอง

source: allow submitters to assign their own link flair
th: อนุญาติให้ผู้โพสกำหนดลิงค์ไอคอนของคัวเอง

source: user flair position
th: ใช้ระบบจัดตำแหน่งไอคอน

source: left
th: ซ้าย

source: position flair to the left of the username
th: วางไอคนไว้ทางซ้ายของชื่อผู้ใช้

source: right
th: ขวา

source: position flair to the right of the username
th: วางไอคอนไว้ที่ด้านขวาของชื่อผู้ใช้

source: link flair position
th: ตำแหน่งไอคอนลิงค์

source: none
th: ไม่มี

source: don't show link flair
th: ไม่แสดงไอคอนลิงค์

source: position flair to the left of the link
th: วางไอคอนไว้ที่ด้านซ้ายของลิงค์

source: position flair to the right of the link
th: วางไอคอนไว้ที่ด้านขวาของลิงค์

source: Show my flair on this subreddit. It looks like:
th: แสดงไอคอนของฉันบนกลีบพิกุลนี้ ผลที่ได้:

source: select flair
th: เลือกไอคอน

source: remove flair
th: เอาไอคอนออก

source: flair selection unavailable
th: ไอคอนที่คุณเลือกไม่สามารถใช้ได้

source: user can edit?
th: ผู้ใช้สามารถแก้ไขได้หรือไม่?

source: clear all flair templates
th: ล้างเทมเพลทไอคอนผู้ใช้ทั้งหมด

source: cleared
th: ล้างเรียบร้อยแล้ว

source: show url
th: โชว์ url

source: hide url
th: ซ่อน url

source: load a random link
th: โหลดลิงค์แบบสุ่ม

source: serendipity
th: ชะตาพาลิขิต

source: visit your userpage
th: ไปยังหน้าผู้ใช้ของคุณ

source: login / register
th: ลงชื่อเข้าใช้ / สมัครสมาชิก

source: new mail
th: มีข้อความใหม่

source: visit this link without the toolbar
th: ชิมลิงค์โดยไม่ใช้ toolbar

source: click to visit the main page for this submission
th: คลิกเพื่อเยี่ยมชมหน้าหลักของกระทู้นี้

source: click to submit this link to reddit
th: คลิกที่นี่เพื่อส่งลิงค์ให้กับพิกุล

source: vote %(direction)s
th: คะแนน %(direction)s

source: like
th: ถูกฝข

source: dislike
th: ไม่ถูกใจ

source: unsave
th: ยกเลิกการบันทึก
