Repository: eakkew/pickul-i18n
Catalog: reddit_i18n/*/LC_MESSAGES/r2.po
Languages: th

source: unsaved
th: ยกเลิกการบันทึกแล้ว

source: unhide
th: ยกเลิกการซ่อน

source: unhidden
th: ยกเลิกการซ่อนเรียบร้อยแล้ว

source: toggle the comments panel
th: เปิดแถบความคิดเห็น

source: Buy for yourself, as an ongoing subscription
th: ซื้อให้ตัวเอง แล้วต่อบรรณาศักดิเมื่อหมดอายุ

source: Buy for yourself, as a one-time purchase
th: ซื้อให้ตัวเอง เพียงครั้งเดียว

source: Give reddit gold to someone else
th: มอบกลีบพิกุลทองให้คนพิเศษ

source: Buy reddit gold "creddits"
th: ซื้อกลีบพิกุลทอง

source: %s / month
th: % ต่อเดือน

source: %s / year (which works out to just %s / month!)
th: %s ต่อปี (ไม่ต่างจาก %s ต่อเดือนนะจ๊ะ)

source: subscribe
th: ติดตาม

source: How many months?
th: จำนวนเดือนที่ต้องการ

source: buy
th: ซื้อ

source: How much gold do you wish to bestow?
th: คุณต้องการส่งกลีบพิกุลกี่ดอก

source: Note: If you want to give more than %(number)d, you'll need to buy more creddits.
th: หมายเหตุ: หากคุณต้องการส่งพิกุลทองมากกว่า %(number)d คุณต้องซื้อกลีบพิกุลเพิ่ม

source: To whom are you giving said gold?
th: คุณต้องการส่งพิกุลทองให้ผู้ใช้ท่านใด?

source: Do you want them to know it came from you?
th: คุณต้องการบอกให้ผู้รับทราบว่าได้รับจากคุณหรือไม่

source: yes, include my username
th: ได้เลย แนบชื่อผู้ใช้ของฉันไปด้วย

source: no, make it anonymous
th: ไม่ ส่งแบบนิรนาม

source: Gift message (optional):
th: ข้อความแนบพร้อมของขวัญ (ไม่จำเป็น):

source: give
th: มอบ

source: How many creddits would you like to buy? (each will allow you to give one month of reddit gold)
th: คุณต้องการซื้อกลีบพิกุลกี่ดอก? (หนึ่งดอกจะเลื่อนบรรณาศักดิ์ให้หนึ่งเดือน)

source: New!
th: ใหม่!

source: Make reddit better.
th: ช่วยสนับสนุนให้พิกุลพัฒนา

source: reddit gold adds shiny extra features to your account that are made possible thanks to support from people like you.
th: ดอกพิกุลทองเพิ่มความสง่างามแก่บัญชีผู้ใช้ของคุณ และเพิ่มฟีเจอร์พิเศษเฉพาะผู้มีบรรณาศักดิ์ขอกราบขอบพระคุณงามๆแก่ผู้ช่วยเหลือ

source: buy reddit gold
th: ซื้อกลีบพิกุลทอง

source: or
th: หรือ

source: send us a postcard
th: ส่งไปรษณีย์บัตรมาหาพวกเรา!

source: # Filter specific subreddits from /r/all. Are there subreddits you don't want to see? Customize /r/all by removing them with a url like /r/all-operative-badger (up to ~300 removals - limited by maximum url length).
th: # คัดกลีบพิกุลที่ต้องการออกจาก กลีบเหมามีกลีบพิกุลที่คุณไม่ต้องการจะอ่าน? แก้ไข กลีบเหมา โดยการเอาออกจาก url เช่น /r/เหมา-สาวแว่น-อาหาร(เอาออกได้ไม่เกินประมาณ 300 ห้อง ซึ่งถูกกำหนดโดยความยาวสูงสุดของ url มาตรฐาน)

source: # More subreddits and comments per page. Our servers work harder for gold members. Subscribe to up to 100 subreddits on your front page. Read comment threads 1500 comments at a time.
th: # อ่านกลีบพิกุลและคอมเมนต์ได้มากขึ้นต่อหน้าสามารถอ่านกลีบพิกุลจากหน้าแรกได้ถึง 100 ห้่องอ่านความคิดเห็นในกระทู้ได้ 1500 ความเห็นต่อครั้ง

source: # New comment highlighting. What's new? Highlight which comments are new since the last time you viewed a thread.
th: # เน้นความคิดเห็นใหม่ มีอะไรใหม่? เน้นความคิดเห็นใหม่หลังจากที่คุณเข้ามาเยี่ยมชมกระทู้นั้นๆ

source: # Save comments and view by subreddit. Save the great comments you'd like to revisit later. Filter your favorite posts and comments by subreddit.
th: เก็บความคิดเห็นที่คุณถูกใจเพื่อกลับมาอ่านอีกกรองโพสและความเห็นที่คุณถูกใจตามกลีบพิกุล

source: # Turn off ads. Advertisements are optional to gold members.
th: # ปิดโฆษณาชาวพิกุลทองไม่จำเป็นต้องรับชมโฆษณา

source: # Friends with benefits. Add notes to keep track of them all.
th: # เพื่อนคน'พิเศษ'อย่าลืมจดรายละเอียดพวกเขา เพื่อจะได้ไม่ลืม

source: The Lounge.
th: ห้องพิกุลทอง

source: Access to a super-secret members-only community that may or may not exist.
th: มีสิทธิการเข้าถึงกลีบพิกุลลับหรือ ลับเฉพาะชาวพิกุลที่ อาจจะหรือ อาจจะไม่มีอยู่จริง ;)

source: Beta test new features.
th: ทดลองใช้งานฟีเจอร์ใหม่

source: We occasionally invite gold members to try out new features first.
th: เรามักจะเชิญชวนให้ผู้ใช้พิกุลทองทดลองฟีเจอร์ใหม่ๆของเราก่อน

source: A trophy on your user page.
th: ถ้วยรางวัลบนหน้าผู้ใช้ของคุณ

source: As thanks for supporting reddit gold.
th: ขอบคุณที่สนับสนุนระบบพิกุลทอง

source: More to come.
th: อีกมากมาย

source: We have many more ideas for gold features, and will add to this list in the future.
th: เรามีไอเดียเพิ่มการใช้งานของชนชั้นพิกุลทอง เราจะเพิ่มฟีเจอร์เรื่อยๆในอนาคต

source: become a member today.
th: เลือนยศวันนี้

source: reddit gold is %(gold_month_price)s / month, or %(gold_year_price)s for a year.
th: พิกุลทองราคา %(gold_month_price)s ต่อเดือน หรือ %(gold_year_price)s ต่อหนึ่งปี

source: send us a postcard | for | 1 free month | of | reddit gold
th: ส่งไปรษณียบัตร | เพื่อ | แลก | ดอกพิกุลทอง | เป็นเวลา | หนึ่งเดือน

source: view the postcard gallery
th: ชมหน้าไปรษณีย์บัตร

source: close
th: ปิด

source: The following gift note will be attached:
th: ข้อความที่จะแนบไปกับของขวัญคือ:

source: Please select a payment method.
th: โปรดเลือกวิธีชำระเงิน

source: Note: Google Checkout does not support ongoing subscriptions at this time.
th: หมายเหตุ: Google Checkout ไม่สนับสนุนการระบบชำระเงินอัตโนมัติในขณะนี้

source: Credit Card
th: บัตรเครดิต

source: Stripe is PCI compliant and your credit card information is sent directly to them.
th: แถบนี้คือ PCI compliant และข้อมูลบัตรของคุณจะถูกส่งไปยังพวกเขาโดยตรง

source: card number
th: เลขบัตรเครดิต

source: expiration date
th: วันหมดอายุ

source: address line 1
th: ที่อยู่ บรรทัดที่ 1

source: address line 2
th: ที่อยู่ บรรทัดที่ 2

source: city
th: จังหวัด

source: state/province
th: รัฐ/เขต

source: country
th: ประเทศ

source: zip
th: รหัสไปรษณีย์

source: Submit
th: ส่ง

source: ready for something new? %s subscribe %s to some new subreddits.
th: พร้อมจะลองอะไรใหม่ๆไหม? %s ลองติดตาม %s กลีบพิกุลใหม่ๆดูครับ

source: it looks like you haven't %s subscribed %s to any subreddits yet. want some ideas?
th: ดูเหมือนว่าคุณจะยังไม่ได้ %s ติดตาม %s กลีบพิกุลไหนเลยต้องการให้เราแนะนำไหม?

source: what are you interested in?
th: คุณสนใจในเรื่องใดบ้าง?

source: try these:
th: ลอง:

source: language traffic statistics
th: สถิติ traffic ตามภาษาผู้ใช้

source: traffic by language
th: traffic ตามภาษาผู้ใช้

source: Adult content: Not Safe For Work
th: เนื้อหาสำหรับผู้ใหญ่: ไม่ปลอดภัยสำหรับที่สาธารณะ

source: NSFW
th: ไม่ปลอดภัยสำหรับที่สาธารณะ

source: (no need to click for this info; just hover over the checkmark next time)
th: (ไม่จำเป็นต้องกดเพื่อดูข้อมูลนี้ เพียงแค่เลื่อนเมาส์มาที่สัญลักษษณ์พอครับ)

source: disable contest mode
th: หยุดใช้ระบบแข่งขัน

source: contest mode disabled
th: หยุดการใช้งานระบบแข่งขันแล้ว

source: enable contest mode
th: ใช้งานระบบแข่งขัน

source: contest mode enabled
th: ระบบแข่งขันถูกใช้งาน

source: contest mode: scores hidden
th: อยู่ในช่วงการแข่งขัน: คะแนนจะถูกซ่อนไว้

source: contest mode randomizes sorting and hides scores. this feature is temporarily available to assist best of 2012 contests.
th: ระบบแข่งขันจะทำการเรียงแบบสุ่มและซ่อนคะแนน ระบบนี้สร้างขึ้นสำหรับช่วยเหลือการแข่งขัน สุดยอดของปี

source: this post was submitted on
th: กระทู้นี้ถูกส่งมาเมื่อ

source: like it
th: กดถูกใจ

source: up vote
th: คะแนนบวก

source: down vote
th: คะแนนลบ

source: comments from %(site)s
th: ควมคิดเห็นจาก %(site)s

source: view more:
th: รับชมเพิ่ม:

source: there doesn't seem to be anything here
th: ที่นี่ไม่มีอะไรครับ

source: you are logged in. go use the site!
th: คุณกำลังล๊อคอินอยู่

source: username
th: ชื่อผู้ใช้

source: try another
th: ลองชื่ออื่นดู

source: available!
th: ใช้ได้!

source: account recovery email
th: อีเมล์สำหรับการกู้บัญชีผู้ใช้

source: optional
th: ไม่จำเป็น

source: we will only send email at your request
th: เราจะส่งอีเมล์หาคุณเมื่อคุณขอเท่านั้น

source: verify password
th: ยืนยันรหัสผ่าน

source: remember me
th: จดจำฉัน

source: recover password
th: ลืมรหัสผ่าน

source: create account
th: สร้างบัญชีผู้ใช้

source: login
th: ลงชื่อเข้าใช้

source: create a new account
th: สร้างบัญชีผู้ใช้ใหม่

source: all it takes is a username and password
th: เราใช้เพียงแค่ชื่อผู้ใช้และรหัสผ่าน

source: is it really that easy? only one way to find out...
th: มันจะง่ายขนาดนั้นเลยเหรอ? ลองดูเองสิ

source: already have an account and just want to login?
th: คุณมีบัญชีผู้ใช้และเพียงแค่จะลงชื่อเข้าใช้หรือไม่?

source: expand all
th: ขยายข้อความทั้งหมด

source: collapse all
th: ยุบข้อความทั้งหมด

source: show parent
th: แสดงข้อความก่อนหน้า

source: send a message
th: ส่งข้อความ

source: (username, or /r/name for that subreddit's mods)
th: (ชื่อผู้ใช้ หรือ /r/name สำหรับผู้ดูแลกลีบพิกุลนั้น)

source: to
th: ถึง

source: subject
th: หัวข้อ

source: leave
th: ออก

source: you are no longer a moderator
th: คุณไม่ได้เป็นผู้ดูแลแล้ว

source: stop being a moderator?
th: เลิกเป็นผู้ดูแล?

source: accept
th: ตอบรับ

source: you are now a moderator. welcome to the team!
th: คุณได้เป็นผู้ดูแลแล้ว ยินดีต้อนรับเข้าทีม

source: become a moderator of %s?
th: เป็นผู้ดูแลของ %s

source: you are invited to become a moderator. %(action)s
th: คุณได้ถูกเชิญชวนมาเป็นผู้ดูแล %(action)s

source: invite
th: เชิญ

source: pending invitations
th: คำเชิญชวนที่กำลังรอคำตอบรับ

source: load more comments
th: โหลดความคิดเห็นเพิ่ม

source: reply
th: ข้อความตอบรับ

source: [+] load the full conversation.
th: [+] โหลดบทสนทนาตัวเต็ม

source: continue this thread
th: อ่านกระทู้นี้ต่อ

source: reddit
th: พิกุล

source: submit to %(sr)s
th: ส่งไปยัง %(sr)s

source: suggest title
th: หัวข้อที่เราแนะนำ

source: (optional)
th: (ไม่จำเป็น)

source: text
th: ข้อความ

source: choose a subreddit
th: เลือกกลีบพิกุล

source: send replies to my inbox
th: ส่งการตอบรับไปยังกล่องจดหมายของฉัน

source: beta
th: ช่วงทดลอง

source: why a brick? read to the bottom of the rules page to find out!
th: ทำไมต้องเป็นหลักศิลา? อ่านด้านล่างของหน้ากฏเพื่อทราบคำตอบ

source: please be mindful of reddit's %(few_rules)s and practice %(good_reddiquette)s.
th: โปรดทราบว่าพิกุลมี %(few_rules)s และปฏิบัติ%(good_reddiquette)s

source: few rules
th: กฏต่างๆ

source: good reddiquette
th: จริยธรรมการเป็นลูกพิกุลที่ดี

source: %(app)s requests to connect with your reddit account.
th: %(app)s ขออนุมัติการเชื่อมต่อกับบัญชีผู้ใช้พิกุลของคุณ

source: Allow %(app)s to:
th: อนุญาติ %(app)s ให้กับ:

source: %(app)s will not be able to access your reddit password.
th: %(app)s จะไม่สามารถเข้าถึงรหัสผ่านพิกุลของคุณ

source: Allow
th: อนุญาติ

source: Decline
th: ปฏิเสธ

source: The address '%(email)s' will no longer receive email from us.
th: ที่อยู่ '%(email)s' นี้จะไม่ได้รับอีเมล์จากเราอีก

source: A confirmation email has been queued up and should be reaching you shortly. It will be the last you hear of us.
th: อีเมล์ยืนยันได้ถูกเตรียมการและกำลังจะส่งไปถึงคุณอีกไม่นานนี้นั่นจะเป็นสิ่งสุดท้ายที่คุณจะได้รับจากเรา

source: Would you like the address %(email)s to no longer receive email from us?
th: คุณที่ต้องที่จะไม่ให้เราส่งจดหมายหาคุณไปยัง %(email)s หรือไม่?

source: yes
th: ใช่

source: no
th: ไม่

source: '%(email)s' has been removed from our block list.
th: '%(email)s' ได้ถูกลบออกจากรายการที่ถูกบล๊อคของเรา

source: Allow '%(email)s' to receive email from us?
th: อนุญาติให้เราส่งจดหมายไปยัง '%(email)s' หรือไม่?

source: you must be at least eighteen to view this subreddit
th: คุณต้องอายุอย่างน้อย 18 ปีเพื่อที่จะเข้ากลีบพิกุลนี้

source: are you over eighteen and willing to see adult content?
th: คุณอายุมากกว่า 18 ปี และสมัครใจที่จะอ่านเนื้อหาสำหรับผู้ใหญ่หรือไม่?

source: what's my password?
th: อะไรคือรหัสผ่านของฉัน?

source: enter your user name below to receive your login information
th: โปรดใส่รหัสผู้ใช้ของคุณด้านล่างข้อความนี้เพื่อ รับข้อมูลการเข้าใช้

source: password reset link expired. please try again
th: ลิงค์ขอรหัสผ่านใหม่หมดอายุ โปรดลองอีกครั้ง

source: email me
th: ส่งอีเมล์มาหาฉัน

source: (required)
th: (จำเป็น)

source: one-time password
th: รหัสผ่านชั่วคราว

source: remember this computer
th: จำการลงชื่อเข้าใช้จากเครื่องนี้

source: set up payment for this link
th: ตั้งค่าการชำระเงินสำหรับลิงค์นี้

source: Your current bid is $%(bid)s
th: การประมูลปัจจุบันของคุณคือ ฿%(bid)s

source: (total for the duration provided)
th: (ผลรวมของระยะเวลาที่ให้มา)

source: Please pick your credit card:
th: โปรดเลือกบัตรเครดิตของคุณ

source: select...
th: เลือก...

source: profile limit (%d) reached
th: ข้อมูฃจำกัดที่ (%d) ครั้งแล้ว

source: create a new one...
th: สร้างใหม่...

source: please create a new payment profile
th: โปรดสร้างประวัติการจ่ายเงินใหม่

source: NOTE: your card will not be charged until the link has been queued for promotion.
th: หมายเหตุ: บัตรเครดิตของคุณจะไม่ถูกตัดเงินจนกว่าลิงค์ของคุณจะเข้าคิวสำหรับโปรโมชั่น

source: first name
th: ชื่อจริง

source: last name
th: นามสกุล

source: company
th: บริษัท

source: address
th: ที่อยู่

source: state
th: รัฐ

source: phone
th: โทรศัพท์

source: (14-17 digits)
th: (14-17 ตัวเลข)

source: (3 or 4 digits)
th: (3 หรือ 4 ตัวเลข)

source: authorize payment
th: อนุมัติการชำระเงิน

source: you are viewing a single comment's thread.
th: คุณกำลังดูกระทู้ความคิดเห็นเดียว

source: view the rest of the comments
th: แสดงความคิดเห็นที่เหลือ

source: (that's you!)
th: (นั่นคือคุณ!)

source: updating...
th: กำลังอัพเดท...

source: secret
th: ลับ

source: about url
th: เกี่ยวกับ uri

source: redirect uri
th: เปลี่ยนทิศ uri

source: update app
th: อัพเดท app

source: developers
th: ผู้พัฒนา

source: adding...
th: กำลังเพิ่ม...

source: add developer
th: เพิ่มผู้พัฒนา

source: delete app
th: ลบapp

source: Only in the subreddits:
th: เฉพาะในกลีบพิกุล:

source: Expires in:
th: หมดอายุ:

source: Maintain this access indefinitely (or until manually revoked).
th: คงสภาพสิทธิการเข้าถึงอย่างไม่มีกำหนด (หรือจนกว่าจะทำการเพิกถอนด้วยตัวเอง)

source: Only in:
th: เฉพาะใน:

source: revoke access
th: เพิกถอนสิทธิ

source: revoked
th: ถูกเพิกถอน

source: authorized applications
th: อนุมัติ application

source: developed applications
th: application ที่พัฒนาแล้ว

source: create another app...
th: ต้องการสร้าง app เพิ่ม...

source: are you a developer? create an app...
th: คุณเป็นผู้พัฒนา? สร้าง app สิครับ

source: creating...
th: กำลังสร้าง

source: create application
th: สร้าง application

source: create app
th: สร้าง app

source: delete your reddit account
th: ลบบัญชีผู้ใช้พิกุล

source: deleting...
th: กำลังทำการลบ

source: sorry to see you go!
th: จะไปจริงเหรอครับ :(

source: * if you're having a problem on reddit, please consider [contacting us](/feedback) about it before deleting your account. * deleting your account will not delete the content of posts and comments you've made on reddit. to do so, please delete them individually.
th: * หากคุณมีปัญหาในการใช้พิกุล โปรด[ติดต่อพวกเรา](/feedback)เกี่ยวกับปัญหาก่อนที่จะลบบัญชีผู้ใช้ของคุณ * การลบบัญชีผู้ใช้ของคุณจะไม่ลบความเห็น หรือกระทู้ที่คุณโพสไว้บนพิกุล หากคุณต้องการ โปรดลบกระทู้นั้นด้วยตัวเอง

source: why are you deleting this account?
th: ทำไมคุณถึงจะลบบัญชีผู้ใช้

source: for security purposes
th: สำหรับความปลอดภัย

source: account credentials
th: ความน่าเชื่อถือของบัญชีผู้ใช้

source: confirmation
th: การยืนยัน

source: I understand that deleted accounts are not recoverable.
th: ฉันยอมรับและเข้าใจว่าการลบบัญชีผู้ใช้ไม่สามารถย้อนกลับได้

source: delete account
th: ลบบัญชีผู้ใช้

source: Private RSS feeds
th: RSS feed ส่วนตัว

source: On this page are links to private RSS feeds so that you can get listings of your content (personalized front page, message panel, saved listing, etc.) without having to deal with cookies or other auth.
th: บนหน้านี้คือลิงค์ไปยัง RSS feed ส่วนตัวของคุณ ที่คุณจะสามารถรับติดตามรายการสาระที่คุณติดตาม (หน้าแรกของคุณ หน้าข้อความ รายการที่คุณบันทึกไว้ เป็นต้น)โดยที่ไม่ต้องใช้ cookies หรือการใช้ระบบรับรองอื่น

source: Keep in mind that these urls are intended to be private, so **share at your own risk.**
th: โปรดทราบว่า url เหล่านี้ไม่เปิดเผยต่อสาธารณะ เพราะฉะนั้น **โปรดระมัดระวังหากคุณต้องการะจะแบ่งปันให้ผู้อื่น**

source: All feeds are invalidated if you change your password, however.
th: อย่างไรก็ตาม ข้อมูลที่จะป้อนให้จะไม่ถูกต้องหากคุณเปลี่ยนรหัสผ่าน

source: your front page
th: หน้าแรกของคุณ

source: your saved links
th: ลิงค์ที่คุณบันทึกไว้

source: links you've liked
th: ลิงค์ที่คุณถูกใจ

source: links you've disliked
th: ลิงค์ที่คุณไม่ถูกใจ

source: links you've hidden
th: ลิงค์ที่คุณซ่อนไว้

source: everything
th: ทุกอย่าง

source: unread messages
th: ข้อความที่ยังไม่ได้อ่าน

source: messages only
th: ข้อความเท่านั้น

source: comment replies only
th: ความเห็นตอบกลับเท่านั้น

source: self-post replies only
th: ความเห็นตอบกระทู้แสดงความเห็นเท่านั้น

source: your preferences have been updated
th: การตั้งค่าของคุณได้เป็นปัจจุบันแล้ว

source: interface language
th: ภาษาที่ใช้สำหรับเมนู

source: incomplete
th: ไม่สมบูรณ์

source: volunteer to translate
th: อาสาสมัครเพื่อแปลภาษา

source: content language
th: ภาษาของเนื้อหา

source: clicking options
th: การตั้งค่าการกด click

source: display links with a reddit toolbar
th: แสดงลิงค์บน พิกุล toolbar

source: media
th: สื่อต่างๆ

source: show thumbnails next to links
th: แสดงรูปขนาดเล็กข้างลิงค์

source: don't show thumbnails next to links
th: อย่าแสดงรูปขนาดเล็กข้างลิงค์

source: show thumbnails based on that subreddit's media preferences
th: แสดงรูปขนาดเล็กโดยอ้างจากการตั้งค่าของกลีบพิกุลนั้น

source: make safe(r) for work
th: ทำให้ปลอดภัยในที่สาธารณะ

source: (Don't show thumbnails next to anything labeled NSFW)
th: (อย่าแสดงรูปขนาดเล็กถ้าเป็นเนื้อหาที่ไม่ปลอดภัยสำหรับที่สาธารณะ)

source: to enable thumbnails, disable compressed link display
th: เพื่อเปิดใช้รูปขนาดเล็ก กรุณายกเลิกการแสดงลิงค์แบบย่อ

source: link options
th: ตั้งค่าลิงค์

source: show the spotlight box on the front page
th: แสดงกล่องแนะนำบนหน้าแรก

source: (it shows new and promoted links, and gives you a say in what's spam and what isn't.)
th: (กล่องนี้จะแสดงลิงค์ใหม่และลิงค์ที่โปรโมท และให้คุณตัดสินว่ามันเป็น spamหรือไม่ใช่)

source: show me new links on the front page
th: แสดงลิงค์ใหม่บนหน้าแรกให้ฉัน

source: show me links I've recently viewed
th: แสดงลิงค์ที่ฉันพึ่งเยี่ยมชม

source: compress the link display
th: ย่อลิงค์ที่แสดงอยู่

source: don't show links after I've liked them
th: อย่าแสดงลิงค์หลังจากที่ฉันกดถูกใจ

source: (except my own)
th: (ยกเว้นของฉันเอง)

source: don't show links after I've disliked them
th: ไม่ต้องแสดงลิงค์หลังจากที่ฉันกดไม่ถูกใจ

source: display
th: แสดงค่า

source: links at once
th: ลิงค์ทั้งหมดทีเดียว

source: don't show me sites with a score less than
th: อย่าแสดงลิงค์ที่มีคะแนนน้อยกว่า

source: don't show me comments with a score less than
th: อย่าแสดงความคิดเห็นที่มีคะแนนน้อยกว่า

source: comments by default
th: ความคิดเห็นจากการตั้งค่าเริ่มต้น

source: display %(num)s links at once
th: แสดง %(num)s ลิงค์ต่อครั้ง

source: don't show me sites with a score less than %(num)s
th: อย่าแสดงลิงค์ที่มีคะแนนต่ำกว่า %(num)s

source: (blank for none)
th: (จะเว้นว่างไว้ หากไม่มี)

source: comment options
th: ตั้งค่าเกี่ยวกับความคิดเห็น

source: don't show me comments with a score less than %(num)s
th: อย่าแสดงความคิดเห็นที่มีคะแนนน้อยกว่า %(num)s

source: display %(num)s comments by default
th: แสดง %(num)s ความคิดเห็นโดยค่าเริ่มต้น

source: the smaller the number, the faster your comments pages will load
th: ยิ่งมีจำนวนน้อย หน้าความคิดเห็นคุณจะมาเร็วขึ้น

source: messaging options
th: ตั้งค่าการส่งข้อความ

source: show message conversations in the inbox
th: แสดงข้อความบทสนทนาในกล่องข้อความ

source: (only applies when you go to the 'messages' panel)
th: (ใช้ได้เฉพาะเมื่อคุณเข้าไปในหน้า 'ข้อความ' เท่านั้น)

source: collapse messages after I've read them
th: ย่อข้อความหลังจากที่คุณอ่านอัตโนมัติ

source: (otherwise, you'll have to collapse them yourself)
th: (ไม่เช่นนั้น คุณจะต้องย่อข้อความด้วยตัวคุณเอง)

source: mark messages as read when I open my inbox
th: ทำเครื่องหมายว่าอ่านแล้วเมื่อคุณเปิดเข้ามาในกล่องข้อความ

source: (otherwise, they will be marked as read when you click them)
th: (ไม่เช่นนั้น ข้อความจะถูกทำเครื่องหมายว่าอ่านแล้วเมื่อคุณกดที่ข้อความนั้นเท่านั้น)

source: display options
th: แสดงการตั้งค่า

source: allow subreddits to show me custom styles
th: อนุณาติให้กลีบพิกุลแสดงสไตล์ของห้องนั้น

source: show user flair
th: แสดงไอคอนผู้ใช้

source: show link flair
th: แสดงไอคอนที่มีลิงค์

source: show promote tab on front page
th: แสดงแถบโปรโมทบนหน้าแรก

source: I am over eighteen years old and willing to view adult content
th: ฉันอายุมากกว่า 18 ปีและยอมรับที่จะรับชมเนื้อหาสำหรับผู้ใหญ่

source: required to view some subreddits
th: จำเป็นในการเข้าชมกลีบพิกุลบางห้อง

source: label posts that are not safe for work (NSFW)
th: กระทู้ที่ถูกตั้งว่าไม่ปลอดภัยสำหรับที่สาธารณะ

source: enable private RSS feeds
th: เปิดการใช้งาน RSS feeds แบบส่วนตัว

source: (available from the 'RSS feed' tab in prefs)
th: (ใช้ได้จากแถบ RSS feed ในการตั้งค่า)

source: privacy options
th: ตั้งค่าความเป็นส่วนตัว

source: make my votes public
th: เปิดเผยการโหวตของฉันให้ผู้อื่นเห็น

source: let everyone see %(link1)s and %(link2)s
th: อนุญาติให้ทุกคนเห็น %(link1)s และ %(link2)s

source: allow my data to be used for research purposes
th: ฉันอนุณาติให้ใช้ข้อมูลของฉันเพื่อใช้ในการค้นคว้าข้อมูล

source: don't allow search engines to index my user profile
th: ฉันไม่อนุญาติให้ search engine ค้นหาฉันด้วยข้อมูลของฉันได้

source: load core JS libraries from reddit servers
th: โหลดระบบ JS libraries จาก server พิกุล

source: gold options
th: การตั้งค่าพิกุลทอง

source: show the right sidebar ad box
th: แสดงกล่องโฆษณาที่แถบด้านขวา

source: show sponsored links
th: แสดงลิงค์ของผู้สนับสนุน

source: the blue advertisements that sometimes appear on the top of the page
th: โฆษณาสีฟ้าที่มักจะขึ้นมาที่ด้านบนของหน้านี้

source: show sponsorships
th: แสดงผู้สนับสนุน

source: the 300x100 'sponsored by...' images that sometimes appear in sidebars
th: รูป 'สนับสนุนโดย...' ขนาด 300x100 ที่มักจะโผล่ที่แถบด้านข้าง

source: highlight new comments
th: เน้นความคิดเห็นใหม่

source: we'll remember your visits for 48 hours and show you which comments you haven't seen yet
th: เราจะจำการเยี่ยมชมของคุณใน 48 ชั่วโมงที่ผ่านมาและ แสดงความคิดเห็นที่คุณยังไม่ได้อ่านก่อนนี้

source: two-factor authentication is currently **enabled**. fill out the form below if you would like to disable it.
th: two-factor authentication กำลังถูก**ใช้งาน**อยู่ กรุณาใส่ข้อมูลข้างล่างหากคุณต้องการระงับการใช้งาน

source: disable
th: ระงับการใช้งาน

source: enter your current password below to start the activation process for two-factor authentication.
th: ใส่รหัสผ่านปัจจุบันของคุณที่ด้านล่างข้อความนี้ เพื่อเปิดการใช้งานtwo-factor authentication

source: activate
th: เปิดการใช้งาน

source: below is your two-factor authentication secret. you can scan the QR code with Google Authenticator or enter the key below manually. you WILL NOT have another chance to see this secret.
th: ข้างล่างข้อความนี้เป็น two-factor authenticationลับ คุณสามารถสแกน QR codeด้วย Google Authenticator หรือใส่รหัสข้างล่างด้วยตัวคุณเอง คุณจะไม่เห็นรหัสลับนี้อีกเป็นครั้งที่สอง

source: enable
th: เปิดใช้งาน

source: update your email or password
th: อัพเดทอีเมล์หรือรหัสผ่านของคุณ

source: verify your email
th: ยืนยันอีเมล์ของคุณ

source: update your email
th: เปลี่ยนอีเมล์ของคุณ

source: update your password
th: เปลี่ยนรหัสผ่านของคุณ

source: not set
th: ไม่ได้ถูกตั้งค่า

source: verified
th: ยืนยันแล้ว

source: verification pending
th: กำลังดำเนินการทำกานยืนยัน

source: click to resend
th: คลิกเพื่อส่งใหม่

source: unverified
th: ยกเลิกการยืนยัน

source: click to verify
th: คลิกเพื่อยืนยัน

source: current password
th: รหัสผ่านปัจจุบัน

source: new password
th: รหัสผ่านใหม่

source: send verification email
th: ส่งอีเมล์สำหรับการยืนยัน

source: upvote
th: โหวตขึ้น

source: downvote
th: โหวตลง

source: approve
th: อนุมัติ

source: report
th: แจ้งความ

source: nsfw
th: ไม่ปลอดภัยสำหรับที่สาธารณะ

source: marked
th: ถูกกาเครื่องหมายแล้ว

source: un-nsfw
th: เอาแท็กไม่ปลอดภัยสำหรับที่สาธารณะออก

source: unmarked
th: เอาเครื่องหมายออก

source: distinguishing...
th: กำลังทำการจำแนก

source: distinguish this?
th: จำแนกสิ่งนี้?

source: confirm spam
th: ยืนยัน spam
