Repository: eakkew/pickul-i18n
Catalog: reddit_i18n/*/LC_MESSAGES/r2.po
Languages: th

source: remove ham
th: ลบ ham ออก

source: reapprove %(obj)s
th: อนุมัติ %(obj)s ใหม่

source: approve %(obj)s
th: อนุมัติ %(obj)s

source: cancel
th: ยกเลิก

source: hidden
th: ถูกซ่อน

source: reject
th: ปฏิเสธ

source: accepted
th: ตกลง

source: permalink
th: ลิงค์ถาวร

source: context
th: ความคิดเห็นแม่

source: full comments
th: ความคิดเห็นแบบเต็ม

source: parent
th: ความเห็นแม่

source: give reddit gold in appreciation of this comment.
th: มอบพิกุลทองด้วยความถูกใจในความคิดเห็นนี้

source: give gold
th: มอบพิกุลทอง

source: reply {verb}
th: ตอบกลับ

source: block user
th: ผู้ใช้งานที่ถูกบล๊อค

source: blocked
th: ถูกบล๊อค

source: mark unread
th: ตั้งให้ยังไม่ได้อ่าน

source: are you sure?
th: คุณแน่ใจรึเปล่า?

source: toggle
th: ใช้งาน

source: + friends
th: + เพื่อน

source: - friends
th: - เพื่อน

source: link karma
th: คะแนนลิงค์

source: comment karma
th: คะแนนความคิดเห็น

source: of reddit gold remaining
th: ของเวลาพิกุลทองที่เหลืออยู่

source: Recurring Paypal subscription
th: ระบบชำระเงินอัตโนมัติบน Paypal

source: send message
th: ส่งข้อความ

source: redditor for
th: เป็นชาวพิกุลมา

source: No campaigns for this link. Would you like to [create one](%(url)s)?
th: ไม่มีโปรโมชั่นสำหรับลิงค์นี้ คุณต้องการจะ [สร้างโปรโมชั่น](%(url)s)หรือไม่?

source: start
th: เริ่ม

source: end
th: จบ

source: target
th: เป้าหมาย

source: bid
th: ประมูล

source: (live now)
th: (สดขณะนี้)

source: totals are preliminary until 24 hours after the end of the promotion.
th: ผลรวมจะไม่เป็นทางการจนกว่าจะผ่านไป 24 ชั่วโมงหลังจากจบโปรโมชั่น

source: Data is updated hourly. Last update: %s
th: ข้อมูลจะถูกอัพเดททุกชั่วโมง อัพเดทล่าสุด: %s

source: Lifetime Stats:
th: สถิติทั้งหมด

source: %s impression
th: %s คนสนใจ

source: %s click
th: %s ครั้งที่กด

source: (download data as .csv)
th: (ดาวโหลดข้อมูลเป็น .csv)

source: click-through (%)
th: กดเข้าชม (%)

source: date
th: วันที่

source: unique
th: จำนวนการดู

source: total
th: ผลรวม

source: Sponsored link calendar
th: ปฏิทินลิงค์ผู้สนับสนุน

source: Viewing calendar for dates:
th: กำลังดูปฏิทินสำหรับวันที่:

source: Sorry, I couldn't make sense of the date range: %(start)s - %(end)s
th: ขอโทษครับ ผมไม่เข้าใจวันที่ที่ให้มานี้​: %(start)s - %(end)s

source: Date
th: วันที่

source: Count
th: จำนวน

source: Scheduled
th: วางกำหนดการแล้ว

source: Inventory
th: รายการสินค้า

source: Impressions
th: จำนวนคนสนใจ

source: Clicks
th: จำนวนครั้งที่กด

source: Total Commit
th: จำนวนที่ถูกโปรโมท

source: Your Commit
th: ลิงค์โปรโมทของคุณ

source: historical site performance
th: ประวัติผลงานของไซท์

source: to be promoted by %(author)s
th: จะถูกโปรโมทโดย %(author)s

source: promoted by %(author)s
th: ถูกโปรโมทโดย %(author)s

source: deleted sponsored link
th: ลิงค์ผู้สนับสนุนที่ถูกลบ

source: unpaid sponsored link
th: ลิงค์ผู้สนับสนุนที่ยังไม่ได้รับการชำระเงิน

source: unapproved sponsored link
th: ลิงค์ผู้สนับสนุนที่ยังไม่ถูกอนุมัติ

source: rejected sponsored link
th: ลิงค์ผู้สนับสนุนที่ถูกปฏิเสธ

source: sponsored link
th: ลิงค์ของผู้สนับสนุน

source: accepted sponsored link
th: ลิงค์ผู้สนับสนุนที่ได้รับการตอบรับ

source: promotion traffic
th: traffic ของโปรโมชั่น

source: (download as .csv)
th: (ดาวโหลดเป็น .csv)

source: create a promotion
th: สร้างโปรโมชั่น

source: edit promotion
th: แก้ไขโปรโมชั่น

source: campaign dashboard
th: หน้าแรกของโปรโมชั่น

source: You have too many campaigns for this link.
th: คุณได้สร้างโปรโมชั่นมากเกินไปสำหรับลิงค์นี้

source: It's time to start fresh!
th: ได้เวลาเริ่มงานกันแล้ว!

source: upload header image:
th: อัพโหลดรูปเฮดเดอร์

source: disable comments
th: ระงับการให้ความคิดเห็น

source: width
th: ความกว้าง

source: height
th: ความสูง

source: promotion history
th: ประวัติโปรโมชั่น

source: bidding history
th: ประวัติการประมูล

source: Please note that these traffic totals will lag behind by two to three hours, and that daily totals will be preliminary until 24 hours after the link has finished its run.
th: หมายเหตุ ผลรวม traffic จะช้ากว่าปัจจุบันสองถึงสามชั่วโมง และผลรวมต่อวันจะไม่เป็นยอดจริงจนกว่าจะผ่านไปแล้ว 24 ชั่วโมงหลังจากที่ ลิงค์ถ้าถูกโปรโมทเสร็จแล้ว

source: Campaigns created before Sept 12, 2012 will not be included in these totals.
th: โปรโมชั่นที่คุณสร้างก่อน 12 กันยายน 2555 จะไม่ถูกรวมอยู่ในผลรวม

source: Questions? Email self serve support:
th: มีคำถาม? ส่งอีเมล์หาระบบช่วยเหลือตนเอง

source: Traffic url for link %s
th: Traffic url สำหรับลิงค์ %s

source: You can share this traffic page with other reddit users by adding them to the viewer list below and then sharing the traffic url with them. They will be able to see this stats page but will not be able to edit the promotion.
th: คุณสามารถแบ่งปันหน้า traffic แก่ชาวพิกุลท่านอื่นโดยการเพื่มพวกเขาไปในรายการผู้ชมด้านล่าง และแบ่งปัน traffic url กับพวกเขา ชาวพิกุลท่านอื่นจะสามารถมองเห็นสถิตินี้ แต่ไม่สามารถแก้ไขได้

source: close this window
th: ปิดหน้านี้

source: Use of this site constitutes acceptance of our %(user_agreement)s and %(privacy_policy)s
th: การใช้เวบนี้ ฉันเข้าใจและยอมรับ %(user_agreement)s และ ​%(privacy_policy)s

source: User Agreement {Genitive}
th: ข้อตกลงของผู้ใช้งาน

source: Privacy Policy {Genitive}
th: นโยบายสิทธิส่วนบุคคล

source: %(year)d reddit inc. All rights reserved.
th: %(year)d บริษัทพิกุล All rights reserved.

source: jump to content
th: กระโดดไปที่เนื้อหานี้

source: want to join? %(login_or_register)s in seconds
th: อยากจะเข้าร่วม? %(login_or_register)s ใช้แค่ไม่กี่วินาที

source: mod messages
th: ข้อความจากผู้ดูแล

source: traffic statistics for %(place)s
th: สถิติ traffic ต่อ %(place)s

source: traffic by day of week
th: traffic โดยแต่ละวัน

source: daily mean
th: ค่าเฉลี่ยประจำวัน

source: create a roadblock
th: สร้าง roadblock

source: existing roadblocks
th: มี roadblocks

source: here at reddit, we inscribe our rules on a brick. screw tablets.
th: เราเดินตามรอยพ่อขุนรามคำแหงด้วยการจารึกกฏลงบนศิลาจารึก

source: this brick has no semantic value
th: ศิลาจารึกนี้มีค่าแค่ไว้ทับกระดาษ

source: about %(num)d results in %(second)s
th: ค้นหาได้ %(num)d ภายใน %(second)s

source: satisfied?
th: พอใจไหมล่ะ?

source: thanks for your feedback!
th: ขอบคุณสำหรับคำติชม!

source: converted query to %(syntax)s syntax: %(converted)s
th: แก้รูปแบบคำค้นหาจาก %(syntax)s syntax: %(converted)s

source: too many results? narrow it down to a subreddit!
th: ผลการค้นหาเยอะไป? ลดผลการค้นหาด้วยการเลือกเพียงกลีบพิกุลเดียวสิ!

source: find submissions in "subreddit"
th: ค้นหากระทู้ใน "กลีบพิกุล"

source: find submissions by "username"
th: ค้นหากระทู้โดย "ชื่อผู้ใช้"

source: find submissions from "example.com"
th: ค้นหากระทู้จาก "example.com"

source: search for "text" in url
th: ค้นหา "ข้อความ" ใน url

source: search for "text" in self post contents
th: ค้นหา "ข้อความ" ในเนื้อหาของกระทู้ความเห็น

source: include (or exclude) self posts
th: รวม (หรือคัดออก๗ กระทู้ความเห็น

source: include (or exclude) results marked as NSFW
th: รวม (หรือคัดออก) การค้นหาที่ไม่ปลอดภัยสำหรับที่สาธารณะ

source: see the search faq for details.
th: โปรดค้นหา faq สำหรับรายละเอียด

source: advanced search: by author, subreddit...
th: การค้นหาขั้นสูง: โดยเจ้าของกระทู้, กลีบพิกุล...

source: search reddit
th: ค้นหากลีบพิกุล

source: limit my search to %(path)s
th: จำกัดการค้นหาอยู่ที่ %(path)s

source: send this link to
th: ส่งลิงค์นี้ไปหา

source: (list of emails or usernames)
th: รายการอีเมล์หรือชื่อผู้ใช้

source: your email
th: อีเมล์ของคุณ

source: message {share form}
th: ข้อความ

source: top subreddits
th: กลีบพิกุลยอดนิยม

source: This sponsored link is an advertisement generated with our %(self_serve_advertisement_tool)s.
th: ลิงค์ผู้สนับสนุนนี้คือโฆษณาที่เราสร้างขึ้นอัตโนมัติด้วย%(self_serve_advertisement_tool)s

source: self-serve advertisement tool
th: ระบบสร้างโฆษณาด้วยตัวเอง

source: Get started &rsaquo;
th: เริ่มการใช้งาน &rsaquo

source: This area shows new and upcoming links. Vote on links here to help them become popular, and click the forwards and backwards buttons to view more.
th: หน้านี้จะแสดงลิงค์ใหม่และกำลังมาแรง โปรดโหวดเพื่อช่วยลิงค์พวกนี้เป็นที่นิยม และกดปุ่มไปข้างหน้าหรือข้างหลัง เพื่อดูเพิ่มขึ้น

source: here
th: ที่นี่

source: This element has been disabled.
th: ระบบนี้ได้ถูกปิดการใช้งาน

source: Click %(here)s to disable this feature.
th: กด %(here)s เพื่อปิดการใช้งาน feature นี้

source: Enter a keyword or topic to discover new subreddits around your interests. Be specific!
th: ใส่keyword หรือหัวข้อเพื่อค้นหากลีบพิกุลใหม่ๆ ตามความสนใจของคุณโปรดเจาะจง

source: You can access this tool at any time on the %(reddits)s page.
th: คุณสามารถเข้าถึง toolนี้ได้ทุกเวลาที่กลีบ %(reddits)s

source: a community for %(time)s
th: เป็นชุมชนมา %(time)s

source: unsubscribe
th: เลิกติดตาม

source: not approved
th: ไม่ได้รับการรับรอง

source: over18
th: มากกว่า18

source: logged-in users viewing this subreddit in the past 15 minutes
th: จำนวนผู้ใช้งานที่ลงชื่อเข้าใช้ที่ดูกลีบพิกุลนี้ในช่วง 15 นาที

source: change
th: เปลี่ยน

source: you are no longer an approved submitter
th: คุณไม่ได้เป็นผู้โพสที่ถูกรับรองแล้ว

source: stop being an approved submitter?
th: เลิกเป็นผู้โพสที่ถูกรับรอง?

source: you are an approved submitter on this subreddit. (%(leave)s)
th: คุณได้เป็นผู้โพสที่ถูกรับรองบนกลีบพิกุลนี้ (%(leave)s)

source: created by&#32;%(user)s
th: สร้างโดย&#32;%(user)s

source: a community for
th: เป็นสังคมสำหรับ

source: approve this subreddit
th: รับรองกลีบพิกุลนี้

source: ban this subreddit
th: แบนกลีบพิกุลนี้

source: Your edit will not be saved!
th: การแก้ไขของคุณจะไม่ถูกบันทึก!

source: show the default stylesheet
th: ใช้ค่าstylesheetเริ่มต้น

source: hide the default stylesheet
th: ซ่อน stylesheet ค่าเริ่มต้น

source: preview
th: ตัวอย่าง

source: normal link
th: ลิงค์แบบปกติ

source: compressed link
th: ลิงค์แบบย่อ

source: link with thumbnail
th: ลิงค์พร้อมกับรูปขนาดเล็ก

source: images
th: รูปภาพ

source: image file
th: ไฟล์รูปภาพ

source: new image name:
th: ชื่อรูปภาพใหม่:

source: (image names should consist of alphanumeric characters and '-' only)
th: (ชื่อรูปควรจะประกอบด้วยตัวอักษร, ตัวเลขและ '-'เท่านั้น

source: Note: any changes to images here will be reflected immediately on reload and cannot be undone.
th: Note: การเปลี่ยนแปลงรูปภาพที่นี่จะมีผลทันทีเมื่อ reloadและไม่สามารถแก้กลับคืนได้

source: please select an image
th: โปรดเลือกรูป

source: paste into stylesheet
th: paste ลงบน stylesheet

source: delete this image
th: ลบรูปนี้

source: all DART traffic for this subreddit.
th: ดูtraffic ของ DART บนกลีบพิกุลนี้

source: recent 300x100 campaigns in this subreddit:
th: โฆษณาขนาด 300x100 อันล่าสุดในกลีบพิกุล

source: no recent 300x100 campaigns in this subreddit
th: ไม่มีโฆษณาขนาด 300x100 ในกลีบพิกุลนี้

source: All times are in [UTC](http://en.wikipedia.org/wiki/UTC).
th: เวลาทั้งหมดใช้เป็น [GMT](http://en.wikipedia.org/wiki/Greenwich_Mean_Time)+7

source: first
th: อันดับหนึ่ง

source: thanks for subscribing!
th: ขอบคุณที่ติดตามครับ

source: enter your confirmation code below to claim your gift creddits
th: กรุณาใส่รหัสยืนยันข้างล่างเพื่อใช้ดองพิกุลทองที่ได้รับมา

source: enter your confirmation code below to activate reddit gold
th: กรุณาใส่รหัสยืนยันข้างล่างเพื่อใช้ดอกพิกุลทองในการเลื่อนบรรดาศักดิ์

source: You claimed a reddit gold subscription in the last few minutes.
th: คุณพึ่งเลื่อนบรรดาศักดิ์เป็นพิกุลทองเมื่อนาทีที่ผ่านมา

source: You're already a reddit gold subscriber.
th: คุณมีบรรดาศักดิ์พิกุลทองอยู่แล้ว

source: claim
th: ใช้ไปแล้ว

source: unavailable
th: ไม่พร้อมใช้งาน

source: dust
th: มีแต่ฝุ่น

source: %d more
th: %d ดูเพิ่ม

source: Ongoing awards, and their most recent winners:
th: รางวัลยังไม่หมดอายุ ผู้ที่ได้รางวัลคนล่าสุด:

source: won by
th: ชนะโดย

source: recently won by
th: มอบรางวัลให้กับ

source: for this
th: สำหรับ

source: Special awards:
th: รางวัลพิเศษ:

source: Recent activity on your account
th: การเคลื่อนไหวล่าสุดของบัญชีผู้ใช้ของคุณ

source: Location
th: สถานที่

source: Last Visit
th: เยี่ยมชมครั้งล่าสุด

source: Log out of all other sessions
th: ลงชื่อออกจาก sessionอื่นทั้งหมด

source: clear sessions
th: ลบ session

source: Apps you have authorized
th: แอปป์ที่คุณได้รับอนุญาติ

source: add
th: เพิ่ม

source: can't remove
th: ไม่สามารถลบออกได้

source: formatting help
th: ปรับรูปแบบการช่วยเหลือ

source: you type:
th: คุณกำลังพิมพ์

source: you see:
th: คุณจะมองเห็น

source: italics
th: ตัวเอียง

source: bold
th: ตัวหนา

source: item
th: สิ่งของ

source: quoted text
th: ข้อความที่อ้างอิงมา

source: all languages
th: ทุกภาษา

source: some languages
th: บางภาษา

source: upload
th: อัพโหลด

source: Type:
th: ประเภท:

source: uploading
th: กำลังอัพโหลด

source: popular choices
th: ตัวเลือกที่เป็นที่นิยม

source: last edited
th: แก้ไขครั้งสุดท้าย

source: learn more
th: ดูข้อมูลเพิ่มเติม

source: get live %(site)s headlines on your site
th: รับเอาหัวข้อจากเวบของคุณจาก %(site)s

source: just cut and paste the generated code into your site and your specified %(site)s feed will be displayed and updated as new stories bubble up
th: cutและpasteรหัสโปรแกรมที่ให้มาลงบนเวบของคุณ และ %(site)s ที่คุณใส่ลงไปจะแสดงและปรับให้เป็นปัจจุบันหากมีสาระใหม่ขึ้นมา

source: which links do you want to display?
th: ลิงค์ไหนที่คุณต้องการให้แสดง

source: all-time
th: ทั้งพิกุลศก (ทั้งหมด)

source: submitted by
th: ถูกส่งโดย

source: saved by
th: ถูกบันทึกโดย

source: liked by
th: ถูกใจโดย

source: disliked by
th: ไม่ถูกใจโดย

source: listing options
th: ตัวเลือกการแสดงรายการ

source: links from %(domain)s
th: ลิงค์จาก %(domain)s

source: links %(submitted_by)s the user %(who)s
th: ลิงค์ %(submitted_by)s จากผู้ใช้ %(who)s

source: links from the domain %(domain)s
th: ลิงค์จากโดเมน %(domain)s

source: sorting options
th: ตัวเลือกการเลียงลำดับ

source: hottest
th: นิยมสุด

source: newest
th: ใหม่สุด

source: sort links by %(what)s
th: เรียงลิงค์โดย %(what)s

source: date range includes %(when)s
th: ขอบเขตวันที่จะนับจาก %(when)s

source: number of links to show
th: จำนวนลิงค์ที่จะแสดง

source: remove css styling
th: นำรูปแบบ css ออก

source: (the widget will inherit all styles from the page)
th: (วิดเจตจะใช้รูปแบบตามหน้ากลีบพิกุล)

source: enable in-widget voting
th: เปิดใช้ระบบโหวตในวิดเจต

source: (will slow down the rendering)
th: (จะทำให้การแสดงผลช้าลง)

source: two columns
th: สองคอลัมภ์

source: background color
th: สีพื้นหลัง

source: (e.g., FF0000 = red)
th: (เช่น FF0000 เท่ากับ สีแดง)

source: border color
th: ขอบสี

source: the code
th: รหัสโปรแกรม

source: add this into your HTML where you want the %(site)s links displayed
th: เพิ่มหน้านี้ลงไปใน HTML ของคุณในหน้าที่ %(site)s ถูกเลือกอยู่

source: this edit is for you to resolve the conflict, any text in the box below will not save.
th: การแก้ไขนี้มีเพื่อก่อนแก้ไขความขัดแย้ง ข้อความในกล่องด้านล่างจะไม่ถูกบันทึก

source: reason for revision
th: เหตุผลสำหรับการแก้ไข

source: save page
th: บันทึกหน้า

source: submit a discussion
th: ส่งข้อคิดเห็น

source: The page "%s" was not found in this subreddit.
th: ไม่พบหน้า "%s" ในกลีบพิกุลนี้

source: Create page "%s"
th: สร้างหน้า "%s"

source: compare selected
th: เปรียบเทียบ

source: who can edit this page?
th: ใครสามารถแก้ไขหน้านี้ได้?

source: use subreddit wiki permissions
th: แก้ไขสิทธิการเข้าถึงวิกิกลีบพิกุล

source: only approved wiki contributors for this page may edit
th: หน้านี้แก้ไขได้เฉพาะผู้ที่ได้รับอนุญาติ

source: only mods may edit and view
th: ผู้ดูแลสามารถเปิดดูและแก้ไขได้เท่านั้น

source: allow users to edit page
th: อนุญาติให้ผู้ใช้แก้ไขหน้านี้ได้

source: username does not exist
th: ชื่อผู้ใช้ไม่มีอยู่

source: done
th: สำเร็จ

source: save settings
th: บันทึกการตั้งค่า

source: revert here
th: แก้ไขกลับที่นี่

source: this page is empty
th: หน้านี้ไม่มีข้อมูล

source: revision by&nbsp;%s
th: แก้ไขโดย&nbsp;%s
